[{"bookId":"9l-mCgAAQBAJ","title":"A Contested Art","category":"Art","description":"When New Mexico became an alternative cultural frontier for avant-garde Anglo-American writers and artists in the early twentieth century, the region was still largely populated by Spanish-speaking Hispanos. Anglos who came in search of new personal and aesthetic freedoms found inspiration for their modernist ventures in Hispano art forms. Yet, when these arrivistes elevated a particular model of Spanish colonial art through their preservationist endeavors and the marketplace, practicing Hispano artists found themselves working under a new set of patronage relationships and under new aesthetic expectations that tied their art to a static vision of the Spanish colonial past. In A Contested Art, historian Stephanie Lewthwaite examines the complex Hispano response to these aesthetic dictates and suggests that cultural encounters and appropriation produced not only conflict and loss but also new transformations in Hispano art as the artists experimented with colonial art forms and modernist trends in painting, photography, and sculpture. Drawing on native and non-native sources of inspiration, they generated alternative lines of modernist innovation and mestizo creativity. These lines expressed Hispanos’ cultural and ethnic affiliations with local Native peoples and with Mexico, and presented a vision of New Mexico as a place shaped by the fissures of modernity and the dynamics of cultural conflict and exchange. A richly illustrated work of cultural history, this first book-length treatment explores the important yet neglected role Hispano artists played in shaping the world of modernism in twentieth-century New Mexico. A Contested Art places Hispano artists at the center of narratives about modernism while bringing Hispano art into dialogue with the cultural experiences of Mexicans, Chicanas/os, and Native Americans. In doing so, it rewrites a chapter in the history of both modernism and Hispano art. Published in cooperation with The William P. Clements Center for Southwest Studies, Southern Methodist University","shortDescription":"Indeed, Campa believed that Hispanos could “survive the machine age” precisely by “blend[ing] the old and the new” and “impress[ing] living <b>arts</b> upon the practical crafts.”34 Contrary to the views of Anglo patrons, Campa argued that&nbsp;...","authors":["Stephanie Lewthwaite"],"publisher":"University of Oklahoma Press","publishedDate":"2015-10-01","isbn":"0806152885","pageCount":304,"price":33.56,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=9l-mCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=9l-mCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"gBZvBQAAQBAJ","title":"Art, Artisans and Apprentices","category":"Art","description":"Before the foundation of academies of art in London in 1758 and Philadelphia in 1805, most individuals who were to emerge as artists trained in workshops of varying degrees of relevance. Easel painters began their careers apprenticed to carriage, house, sign or ship painters, whilst a few were placed with those who made pictures. Sculptors emerged from a training as ornamental plasterers or carvers. Of the many other trades in a position to offer an appropriate background were ÔlimningÕ, staining, engraving, surveying, chasing and die-sinking. In addition, plumbers gained the right to use oil painting and, for plasterers, the application of distemper was an extension of their trade. Central to the theme of this book is the notion that, for those who were to become either painters or sculptor, a training in a trade met their practical needs. This ÔtrainingÕ was of an altogether different nature to an ÔeducationÕ in an art school. In the past, prospective artists were offered, by means of apprenticeships, an empirical rather than a theoretical understanding of their ultimate vocation. James Ayres provides a lively account of the inter-relationship between art and trade in the late seventeenth to early nineteenth centuries, in both Britain and North America. He demonstrates with numerous, illustrated examples, the many cross-overs in the Ôart and mysteryÕ of artistic training, and, to modern eyes, the sometimes incongruous relationships between the various trades that contributed to the blossoming of many artistic careers, including some of the most illustrious names of the ÔlongÕ eighteenth century.","shortDescription":"“<b>Art</b> History” tends to encompass a relatively narrow band of human endeavour in that it maybe more about“<b>Art</b>”than itisabout “History”. This isdue toatendency for <b>Art</b> History tobe based upon a selection ofexamples of material culture&nbsp;...","authors":["James Ayres"],"publisher":"Oxbow Books","publishedDate":"2014-06-30","isbn":"1782977430","pageCount":448,"price":20.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=gBZvBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=gBZvBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]