[{"bookId":"A62SDwAAQBAJ","title":"Artificial Intelligence in Practice","category":"Business & Economics","description":"Cyber-solutions to real-world business problems Artificial Intelligence in Practice is a fascinating look into how companies use AI and machine learning to solve problems. Presenting 50 case studies of actual situations, this book demonstrates practical applications to issues faced by businesses around the globe. The rapidly evolving field of artificial intelligence has expanded beyond research labs and computer science departments and made its way into the mainstream business environment. Artificial intelligence and machine learning are cited as the most important modern business trends to drive success. It is used in areas ranging from banking and finance to social media and marketing. This technology continues to provide innovative solutions to businesses of all sizes, sectors and industries. This engaging and topical book explores a wide range of cases illustrating how businesses use AI to boost performance, drive efficiency, analyse market preferences and many others. Best-selling author and renowned AI expert Bernard Marr reveals how machine learning technology is transforming the way companies conduct business. This detailed examination provides an overview of each company, describes the specific problem and explains how AI facilitates resolution. Each case study provides a comprehensive overview, including some technical details as well as key learning summaries: Understand how specific business problems are addressed by innovative machine learning methods Explore how current artificial intelligence applications improve performance and increase efficiency in various situations Expand your knowledge of recent AI advancements in technology Gain insight on the future of AI and its increasing role in business and industry Artificial Intelligence in Practice: How 50 Successful Companies Used Artificial Intelligence to Solve Problems is an insightful and informative exploration of the transformative power of technology in 21st century commerce.","shortDescription":"Presenting 50 case studies of actual situations, this book demonstrates practical applications to issues faced by businesses around the globe.","authors":["Bernard Marr"],"publisher":"John Wiley & Sons","publishedDate":"2019-04-15","isbn":"1119548985","pageCount":352,"price":25.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=A62SDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=A62SDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"5pguDwAAQBAJ","title":"The Essentials of Data Science: Knowledge Discovery Using R","category":"Business & Economics","description":"The Essentials of Data Science: Knowledge Discovery Using R presents the concepts of data science through a hands-on approach using free and open source software. It systematically drives an accessible journey through data analysis and machine learning to discover and share knowledge from data. Building on over thirty years’ experience in teaching and practising data science, the author encourages a programming-by-example approach to ensure students and practitioners attune to the practise of data science while building their data skills. Proven frameworks are provided as reusable templates. Real world case studies then provide insight for the data scientist to swiftly adapt the templates to new tasks and datasets. The book begins by introducing data science. It then reviews R’s capabilities for analysing data by writing computer programs. These programs are developed and explained step by step. From analysing and visualising data, the framework moves on to tried and tested machine learning techniques for predictive modelling and knowledge discovery. Literate programming and a consistent style are a focus throughout the book.","shortDescription":"Proven frameworks are provided as reusable templates. Real world case studies then provide insight for the data scientist to swiftly adapt the templates to new tasks and datasets. The book begins by introducing data science.","authors":["Graham J. Williams"],"publisher":"CRC Press","publishedDate":"2017-07-28","isbn":"1351647490","pageCount":322,"price":107.76,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=5pguDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=5pguDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"fo2CDwAAQBAJ","title":"Data Science and Digital Business","category":"Business & Economics","description":"This book combines the analytic principles of digital business and data science with business practice and big data. The interdisciplinary, contributed volume provides an interface between the main disciplines of engineering and technology and business administration. Written for managers, engineers and researchers who want to understand big data and develop new skills that are necessary in the digital business, it not only discusses the latest research, but also presents case studies demonstrating the successful application of data in the digital business.","shortDescription":"Data. Science. and. Digital. Business. Fausto Pedro García Márquez and Benjamin Lev This book combines the analytic principles of digital business and <b>data science</b> with business practice and big data. The interdisciplinary, contributed&nbsp;...","authors":["Fausto Pedro García Márquez","Benjamin Lev"],"publisher":"Springer","publishedDate":"2019-01-04","isbn":"3319956515","pageCount":316,"price":96.45,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=fo2CDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=fo2CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"KD0PEAAAQBAJ","title":"Big Data Analytics in Cybersecurity","category":"Business & Economics","description":"Big data is presenting challenges to cybersecurity. For an example, the Internet of Things (IoT) will reportedly soon generate a staggering 400 zettabytes (ZB) of data a year. Self-driving cars are predicted to churn out 4000 GB of data per hour of driving. Big data analytics, as an emerging analytical technology, offers the capability to collect, store, process, and visualize these vast amounts of data. Big Data Analytics in Cybersecurity examines security challenges surrounding big data and provides actionable insights that can be used to improve the current practices of network operators and administrators. Applying big data analytics in cybersecurity is critical. By exploiting data from the networks and computers, analysts can discover useful network information from data. Decision makers can make more informative decisions by using this analysis, including what actions need to be performed, and improvement recommendations to policies, guidelines, procedures, tools, and other aspects of the network processes. Bringing together experts from academia, government laboratories, and industry, the book provides insight to both new and more experienced security professionals, as well as data analytics professionals who have varying levels of cybersecurity expertise. It covers a wide range of topics in cybersecurity, which include: Network forensics Threat analysis Vulnerability assessment Visualization Cyber training. In addition, emerging security domains such as the IoT, cloud computing, fog computing, mobile computing, and cyber-social networks are examined. The book first focuses on how big data analytics can be used in different aspects of cybersecurity including network forensics, root-cause analysis, and security training. Next it discusses big data challenges and solutions in such emerging cybersecurity domains as fog computing, IoT, and mobile app security. The book concludes by presenting the tools and datasets for future cybersecurity research.","shortDescription":"This chapter introduces big <b>data analytics</b> and highlights the needs and importance of applying big <b>data analytics</b> in cybersecurity to fight against the evolving threat landscape. It also describes the typical usage of big data security&nbsp;...","authors":["Onur Savas","Julia Deng"],"publisher":"CRC Press","publishedDate":"2017-09-18","isbn":"1498772161","pageCount":336,"price":99.28,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=KD0PEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=KD0PEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"dKoxEAAAQBAJ","title":"Big Data Analytics for Improved Accuracy, Efficiency, and Decision Making in Digital Marketing","category":"Business & Economics","description":"The availability of big data, low-cost commodity hardware, and new information management and analytic software have produced a unique moment in the history of data analysis. The convergence of these trends means that we have the capabilities required to analyze astonishing data sets quickly and cost-effectively for the first time in history. They represent a genuine leap forward and a clear opportunity to realize enormous gains in terms of efficiency, productivity, revenue, and profitability especially in digital marketing. Data plays a huge role in understanding valuable insights about target demographics and customer preferences. From every interaction with technology, regardless of whether it is active or passive, we are creating new data that can describe us. If analyzed correctly, these data points can explain a lot about our behavior, personalities, and life events. Companies can leverage these insights for product improvements, business strategy, and marketing campaigns to cater to the target customers. Big Data Analytics for Improved Accuracy, Efficiency, and Decision Making in Digital Marketing aids understanding of big data in terms of digital marketing for meaningful analysis of information that can improve marketing efforts and strategies using the latest digital techniques. The chapters cover a wide array of essential marketing topics and techniques, including search engine marketing, consumer behavior, social media marketing, online advertising, and how they interact with big data. This book is essential for professionals and researchers working in the field of analytics, data, and digital marketing, along with marketers, advertisers, brand managers, social media specialists, managers, sales professionals, practitioners, researchers, academicians, and students looking for the latest information on how big data is being used in digital marketing strategies.","shortDescription":"This book is essential for professionals and researchers working in the field of analytics, data, and digital marketing, along with marketers, advertisers, brand managers, social media specialists, managers, sales professionals, ...","authors":["Singh, Amandeep"],"publisher":"IGI Global","publishedDate":"2021-06-18","isbn":"1799872335","pageCount":310,"price":175.56,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=dKoxEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=dKoxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"H5Q7EAAAQBAJ","title":"Cyberspace, Data Analytics, and Policing","category":"Business & Economics","description":"Cyberspace is changing the face of crime. For criminals it has become a place for rich collaboration and learning, not just within one country; and a place where new kinds of crimes can be carried out, and a vehicle for committing conventional crimes with unprecedented range, scale, and speed. Law enforcement faces a challenge in keeping up and dealing with this new environment. The news is not all bad – collecting and analyzing data about criminals and their activities can provide new levels of insight into what they are doing and how they are doing it. However, using data analytics requires a change of process and new skills that (so far) many law enforcement organizations have had difficulty leveraging. Cyberspace, Data Analytics, and Policing surveys the changes that cyberspace has brought to criminality and to policing with enough technical content to expose the issues and suggest ways in which law enforcement organizations can adapt. Key Features: Provides a non-technical but robust overview of how cyberspace enables new kinds of crime and changes existing crimes. Describes how criminals exploit the ability to communicate globally to learn, form groups, and acquire cybertools. Describes how law enforcement can use the ability to collect data and apply analytics to better protect society and to discover and prosecute criminals. Provides examples from open-source data of how hot spot and intelligence-led policing can benefit law enforcement. Describes how law enforcement can exploit the ability to communicate globally to collaborate in dealing with trans-national crime.","shortDescription":"One often-neglected role for <b>data analytics</b> is in investigating compliance and performance, and using this information to improve operations and personnel management. For example, RMS data typically includes the time of call and the&nbsp;...","authors":["David Skillicorn"],"publisher":"CRC Press","publishedDate":"2021-11-18","isbn":"1000465586","pageCount":274,"price":48.23,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=H5Q7EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=H5Q7EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"bq40DQAAQBAJ","title":"Applied Big Data Analytics in Operations Management","category":"Business & Economics","description":"Operations management is a tool by which companies can effectively meet customers’ needs using the least amount of resources necessary. With the emergence of sensors and smart metering, big data is becoming an intrinsic part of modern operations management. Applied Big Data Analytics in Operations Management enumerates the challenges and creative solutions and tools to apply when using big data in operations management. Outlining revolutionary concepts and applications that help businesses predict customer behavior along with applications of artificial neural networks, predictive analytics, and opinion mining on business management, this comprehensive publication is ideal for IT professionals, software engineers, business professionals, managers, and students of management.","shortDescription":"The data generated is huge in volume and can be structured or unstructured and satisfies all the characteristics of big data. Organizations need big <b>data analytics</b> for better decision making and sustain competitive advantage in the&nbsp;...","authors":["Kumar, Manish"],"publisher":"IGI Global","publishedDate":"2016-09-30","isbn":"1522508872","pageCount":251,"price":117.04,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=bq40DQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=bq40DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"0pruDwAAQBAJ","title":"Machine Learning in Finance","category":"Business & Economics","description":"This book introduces machine learning methods in finance. It presents a unified treatment of machine learning and various statistical and computational disciplines in quantitative finance, such as financial econometrics and discrete time stochastic control, with an emphasis on how theory and hypothesis tests inform the choice of algorithm for financial data modeling and decision making. With the trend towards increasing computational resources and larger datasets, machine learning has grown into an important skillset for the finance industry. This book is written for advanced graduate students and academics in financial econometrics, mathematical finance and applied statistics, in addition to quants and data scientists in the field of quantitative finance. Machine Learning in Finance: From Theory to Practice is divided into three parts, each part covering theory and applications. The first presents supervised learning for cross-sectional data from both a Bayesian and frequentist perspective. The more advanced material places a firm emphasis on neural networks, including deep learning, as well as Gaussian processes, with examples in investment management and derivative modeling. The second part presents supervised learning for time series data, arguably the most common data type used in finance with examples in trading, stochastic volatility and fixed income modeling. Finally, the third part presents reinforcement learning and its applications in trading, investment and wealth management. Python code examples are provided to support the readers' understanding of the methodologies and applications. The book also includes more than 80 mathematical and programming exercises, with worked solutions available to instructors. As a bridge to research in this emergent field, the final chapter presents the frontiers of machine learning in finance from a researcher's perspective, highlighting how many well-known concepts in statistical physics are likely to emerge as important methodologies for machine learning in finance.","shortDescription":"This book introduces machine learning methods in finance.","authors":["Matthew F. Dixon","Igor Halperin","Paul Bilokon"],"publisher":"Springer Nature","publishedDate":"2020-07-01","isbn":"3030410684","pageCount":548,"price":59.35,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=0pruDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=0pruDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"nK-QYHZ0-_gC","title":"Handbook of Natural Language Processing","category":"Business & Economics","description":"The Handbook of Natural Language Processing, Second Edition presents practical tools and techniques for implementing natural language processing in computer systems. Along with removing outdated material, this edition updates every chapter and expands the content to include emerging areas, such as sentiment analysis.New to the Second EditionGreater","shortDescription":"The Handbook of Natural Language Processing, Second Edition presents practical tools and techniques for implementing natural language processing in computer systems.","authors":["Nitin Indurkhya","Fred J. Damerau"],"publisher":"CRC Press","publishedDate":"2010-02-22","isbn":"9781420085938","pageCount":704,"price":35.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=nK-QYHZ0-_gC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=nK-QYHZ0-_gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"REHOBQAAQBAJ","title":"A Course on Statistics for Finance","category":"Business & Economics","description":"Taking a data-driven approach, A Course on Statistics for Finance presents statistical methods for financial investment analysis. The author introduces regression analysis, time series analysis, and multivariate analysis step by step using models and methods from finance. The book begins with a review of basic statistics, including descriptive statistics, kinds of variables, and types of data sets. It then discusses regression analysis in general terms and in terms of financial investment models, such as the capital asset pricing model and the Fama/French model. It also describes mean-variance portfolio analysis and concludes with a focus on time series analysis. Providing the connection between elementary statistics courses and quantitative finance courses, this text helps both existing and future quants improve their data analysis skills and better understand the modeling process.","shortDescription":"Providing the connection between elementary statistics courses and quantitative finance courses, this text helps both existing and future quants improve their data analysis skills and better understand the modeling process.","authors":["Stanley L. Sclove"],"publisher":"CRC Press","publishedDate":"2012-12-06","isbn":"1439892555","pageCount":269,"price":31.86,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=REHOBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=REHOBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"8El2EAAAQBAJ","title":"The Handbook of Evolutionary Economic Geography","category":"Business & Economics","description":"This wide-ranging handbook studies and defines the paradigm of evolutionary economic geography. The distinguished contributors highlight the key conceptual, theoretical and empirical advances, and present a clear statement of their aims, objectives and methods.","shortDescription":"This wide-ranging handbook studies and defines the paradigm of evolutionary economic geography.","authors":["Ron A. Boschma","Ron L. Martin"],"publisher":"Edward Elgar Publishing","publishedDate":"2010","isbn":"1847204910","pageCount":559,"price":37.57,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=8El2EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=8El2EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"pf_XAQAAQBAJ","title":"Economic Geography","category":"Business & Economics","description":"Economic Geography is the most complete, up-to-date textbook available on the important new field of spatial economics. This book fills a gap by providing advanced undergraduate and graduate students with the latest research and methodologies in an accessible and comprehensive way. It is an indispensable reference for researchers in economic geography, regional and urban economics, international trade, and applied econometrics, and can serve as a resource for economists in government. Economic Geography presents advances in economic theory that explain why, despite the increasing mobility of commodities, ideas, and people, the diffusion of economic activity is very unequal and remains agglomerated in a limited number of spatial entities. The book complements theoretical analysis with detailed discussions of the empirics of the economics of agglomeration, offering a mix of theoretical and empirical research that gives a unique perspective on spatial disparities. It reveals how location continues to matter for trade and economic development, yet how economic integration is transforming the global economy into an economic space in which activities are performed within large metropolitan areas exchanging goods, skills, and information. Economic Geography examines the future implications of this evolution in the spatial economy and relates them to other major social and economic trends. Provides a complete introduction to economic geography Explains the latest theory and methodologies Covers the empirics of agglomeration, from spatial concentration measurement to structural estimations of economic geography models Includes history and background of the field Serves as a textbook for students and a resource for professionals","shortDescription":"In other words, at this time, physical <b>geography</b> would have played against economic <b>geography</b>. This type of fascinating historical analysis, although in need of methodological refinement, provides a number of opportunities for&nbsp;...","authors":["Pierre-Philippe Combes","Thierry Mayer","Jacques-François Thisse"],"publisher":"Princeton University Press","publishedDate":"2008-09-08","isbn":"1400842948","pageCount":416,"price":74.2,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=pf_XAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=pf_XAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"bi4lDwAAQBAJ","title":"Challenging Perspectives on Organizational Change in Health Care","category":"Business & Economics","description":"This volume provides theory and research on organizational change and predominantly features the application of these ideas to the health care domain, broadly defined. It addresses enduring issues in advancing to an effective health care system. The aim of this book is to offer an accessible and readable text aimed at provoking thought and questioning, and aiding creativity. It proffers arguments and ideas which are firmly based in empirical data and evidence, so that the reader may make informed personal evaluations. This book is designed to furnish a comprehensive theoretical basis for understanding organizational change in health care, as well as selected core issues of contemporary and future importance to the provision of effective care within sustainable systems. A series of coherent themes are addressed throughout the book from differing perspectives. However, every chapter has been written to standalone and be read independently. Each offers resources relevant to its’ focal topic, in the form of references, case studies and critique. Setting out a future research agenda, the book will be vital reading for organizational change researchers and practitioners in the healthcare industry.","shortDescription":"This volume provides theory and research on organizational change and predominantly features the application of these ideas to the health care domain, broadly defined.","authors":["Louise Fitzgerald","Aoife McDermott"],"publisher":"Taylor & Francis","publishedDate":"2017-04-21","isbn":"1317428005","pageCount":204,"price":30.58,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=bi4lDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=bi4lDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"hF4ABAAAQBAJ","title":"The Survival Guide for Business Families","category":"Business & Economics","description":"First Published in 1999. Routledge is an imprint of Taylor & Francis, an informa company.","shortDescription":"JacMar shares of, 33 in JJ&#39;s nightmare scenario, 104, 109 life-style choice of, 69 as mother, 66 as possible CEO of JacMar, 34 marketability discount, on family <b>business</b> stock, 113 marriage, birth order and, 17, 18 Marriott, John W.,&nbsp;...","authors":["Gerald Le Van"],"publisher":"Routledge","publishedDate":"2014-07-10","isbn":"1135261717","pageCount":240,"price":35.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=hF4ABAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=hF4ABAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"U7SsAgAAQBAJ","title":"How to Start a Home-based Etsy Business","category":"Business & Economics","description":"Money.msn.com has named being an Etsy-based Business Operator one of the top ten ideas for retirees. Etsy receives more than 10 million unique views per month: http://www.etsy.com/ This market both young and old is ideal to target with a specialized How to Start business book that goes beyond that of our craft book and focus solely on how to gain presence on Etsy.","shortDescription":"Most people want to jump the gun and figure out a name for their <b>business</b> first. It is similar to naming a child: You want to callyour <b>business</b>-baby something so that you have a point of reference. I understand the logic behind it,&nbsp;...","authors":["Gina Luker"],"publisher":"Rowman & Littlefield","publishedDate":"2014-01-07","isbn":"1493006819","pageCount":192,"price":19.03,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=U7SsAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=U7SsAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"h01HBQAAQBAJ","title":"The Business Model Navigator","category":"Business & Economics","description":"A strong business model is the bedrock to business success. But all too often we fail to adapt, clinging to outdated models that are no longer delivering the results we need. The brains behind The Business Model Navigator have discovered that just 55 business models are responsible for 90% of the world's most successful businesses. These 55 models – from the Add-On model used by Ryanair to the Subscription model used by Spotify – provide the blueprints you need to revolutionise your business and drive powerful change. As well as providing a practical framework for adapting and innovating your business model, this book also includes each of the 55 models in a quick-read format that covers: What it is Who invented it and who uses it now When and how to apply it “An excellent toolkit for developing your business model.” Dr Heinz Derenbach, CEO, Bosch Software Innovations","shortDescription":"55 Models That Will Revolutionise Your <b>Business</b> Oliver Gassmann, Karolin Frankenberger, Michaela Csik. Dr Petra Bachem, VP Marketing and Sales Excellence, BASF &#39;An aspiring field suchas NewSpace really benefitsfrom the <b>Business</b> Model&nbsp;...","authors":["Oliver Gassmann","Karolin Frankenberger","Michaela Csik"],"publisher":"Pearson UK","publishedDate":"2014-11-10","isbn":"1292065842","pageCount":400,"price":14.83,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=h01HBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=h01HBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"swbKAgAAQBAJ","title":"Essentials of Business Research","category":"Business & Economics","description":"Written specifically for business students, this best-selling, jargon-free textbook highlights each stage of the research process, guiding the reader through actionable steps and explicitly setting out how best to meet a supervisor's expectations. Easy to navigate and full of practical advice, it shows you how to choose a topic and write a proposal, with easy to follow tips and detailed screenshots and diagrams. Key student features include: 'You're the Supervisor' sections - helps students to meet learning objectives 'Common questions and answers' - real-world advice on how to tackle common challenges Examples from different types of international businesses Detailed guidance on software packages such as SPSS Student case studies Annotated further reading Accompanied by a fully integrated companion website designed to support learning. Free to access, it includes author podcasts, guides to online tools, links to downloadable journal articles, examples of completed projects, PowerPoint slides and students' multiple choice questions to test progress. Available on publication: www.uk.sagepub.com/jonathanwilson2e. A must-have title for all business and management students; this is the ideal companion for achieving success in your research project. Lecturers/instructors - request a free digital inspection copy here","shortDescription":"The authors set out the aim of the paper as exploring &#39;the planning strategies of female entrepreneurs who have indicated a desire to grow their <b>businesses</b>, the timehorizons of planning strategies, and the relationship between planning&nbsp;...","authors":["Jonathan Wilson"],"publisher":"SAGE","publishedDate":"2014-01-20","isbn":"1446293475","pageCount":376,"price":46.61,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=swbKAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=swbKAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"pdDPBAAAQBAJ","title":"Summary: The One Page Business Plan","category":"Business & Economics","description":"The must-read summary of Jim Horan's book: \"The One Page Business Plan: Start with a Vision, Build a Company!\" This complete summary of the ideas from Jim Horan's \"The One Page Business Plan\" exposes the significant advantages of using a one-page business plan, in terms of time saving, clear thinking, motivational impact and professional credibility. In this summary, you will discover what a one page business plan ought to be, how to make one, and how to use it to your best advantage. Added-value of this summary: • Save time • Understand the key concepts • Expand your knowledge of entrepreneurship To learn more, read \"The One Page Business Plan\" and discover how to keep your future on one page!","shortDescription":"State why your <b>business</b> will be successful. Examples of effective mission statements: Video Arts is in <b>business</b> to help people take their ideas and move them to the big screen! We find the right employees to make your <b>business</b>&nbsp;...","authors":["BusinessNews Publishing"],"publisher":"Primento","publishedDate":"2014-10-14","isbn":"2511018519","pageCount":15,"price":4.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=pdDPBAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=pdDPBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"NXHWCgAAQBAJ","title":"Business Models and Modelling","category":"Business & Economics","description":"In this volume leading scholars from North America, Europe and Asia come together to explore the topic of business models that takes the demand side (customers and their engagement) seriously. The first part deals with the model dimension of business models. The second part deals with business models and change.","shortDescription":"In this volume leading scholars from North America, Europe and Asia come together to explore the topic of business models that takes the demand side (customers and their engagement) seriously.","publisher":"Emerald Group Publishing","publishedDate":"2015-11-09","isbn":"1785604627","pageCount":480,"price":178.07,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=NXHWCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=NXHWCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"v8jwCgAAQBAJ","title":"Από το μηδέν στο ένα","category":"Business & Economics","description":"Είναι πιο εύκολο να αντιγράψεις κάτι, παρά να φτιάξεις κάτι καινούργιο. Όταν βελτιώνουμε πράγματα που έχουν ήδη κάνει άλλοι, πηγαίνουμε τον κόσμο από το 1 στο n. Όταν όμως δημιουργούμε κάτι εντελώς νέο, πηγαίνουμε από το 0 στο 1. Η πράξη της δημιουργίας του καινούργιου είναι μοναδική, και το αποτέλεσμα είναι πάντα φρέσκο και παράξενο. Αυτό το βιβλίο είναι η χαρτογράφηση της πορείας από το μηδέν στο ένα. «Προσφέρει εντελώς νέες, αναζωογονητικές ιδέες για το πώς μπορούμε να δημιουργήσουμε αξία στον κόσμο» Μάρκ Ζάκερμπεργκ, CEO του Facebook «Ο Πίτερ Τιλ έχει χτίσει πολλές ριζοσπαστικές εταιρείες, και σ’ αυτό το βιβλίο μάς δείχνει το πώς». Ίλον Μάσκ, CEO της Space X και της Tesla","shortDescription":"Είναι πιο εύκολο να αντιγράψεις κάτι, παρά να φτιάξεις κάτι καινούργιο. Όταν βελτιώνουμε πράγματα που έχουν ήδη κάνει άλλοι, ...","authors":["Peter Thiel","Blake Masters"],"publisher":"Εκδόσεις Καστανιώτη","publishedDate":"2015-11-16","isbn":"9600359946","pageCount":240,"price":9.9,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=v8jwCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=v8jwCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"zdu_DgAAQBAJ","title":"Selling Your Value Proposition","category":"Business & Economics","description":"A value proposition is created from the combination of a company's products and services, and the value gained by the customer. It is used to drive better business, and is essential to success for any business - without it, companies are at risk of losing customers and being drowned out in crowded marketplaces. Selling Your Value Proposition is a practical, user-friendly guide to establishing a streamlined customer-centric selling process to communicate and express value propositions, enabling companies to convey their value-creating stories to customers consistently. Featuring case studies and interviews with renowned business leaders and influencers, Selling Your Value Proposition demonstrates how value propositions adeptly position a business across a range of industries. The techniques and skills shared have all been honed through the authors' experience with more than 600 companies around the world, and clear, step-by-step guidelines will empower all readers to effectively focus their value propositions for competitive success.","shortDescription":"Selling Your Value Proposition is a practical, user-friendly guide to establishing a streamlined customer-centric selling process to communicate and express value propositions, enabling companies to convey their value-creating stories to ...","authors":["Cindy Barnes","Helen Blake","Tamara Howard"],"publisher":"Kogan Page Publishers","publishedDate":"2017-05-03","isbn":"0749479922","pageCount":232,"price":39.25,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=zdu_DgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=zdu_DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"LQuWDwAAQBAJ","title":"Economics for Policy Makers","category":"Business & Economics","description":"Certain key economic decisions taken by organizations and indeed countries are often not made by economists but by businessmen, trade unionists, politicians and policy-makers. Those who employ people, those who represent workers, those who make laws and those who elect them need economics but may have little time or desire to study it. This book makes economics easily available to everyone. The author’s use of simple language and avoidance of technical jargon provides non-economists with a better understanding of economic reasoning and the tools \"to know and to decide\". The author achieves this through introducing key concepts in short presentations and arming the reader with selected press articles and recent research using these concepts. An analysis of these demonstrates how a general concept can be derived from a specific context and highlighted questions provide the basis for further debate. The reader can then focus on the parts most relevant to their own needs. This book will have great appeal to employers, trade unionists and public officials attending courses organized by international institutions, professional training providers, as well as graduate students of courses where economics is an important element, especially in relation to its policy implications. Finally, it is invaluable for anybody who has wanted to learn the basics of practical economics but has been deterred by its technicalities.","shortDescription":"Those who employ people, those who represent workers, those who make laws and those who elect them need economics but may have little time or desire to study it. This book makes economics easily available to everyone.","authors":["Gustavo Rinaldi"],"publisher":"Routledge","publishedDate":"2019-04-16","isbn":"0429754663","pageCount":330,"price":27.19,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=LQuWDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=LQuWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"r1ZxDwAAQBAJ","title":"Collected Papers in Theoretical Economics (Volume V): Economic Policy and Its Theoretical Bases","category":"Business & Economics","description":"Effective policymaking is based on economics which is a blend of empiricism as well as theory. It needs to be grounded not only in data, statistics, and the regularities observed therein, but also analytics, deductive reasoning, and logic, which are the constituents of theory. Published during 2009–16, the seven years that Basu spent as a policymaker—first as chief economic adviser to the Government of India and then as chief economist of the World Bank—this volume draws on the work done by empirical economists and is rooted in analytics, even while addressing practical, down-to-earth problems. The papers having a direct bearing on economic policymaking in this quintessential compilation range from topics such as financial regulation, global policy coordination, aspects of the Indian economy like fiscal and monetary policy design, inflation management, food-grain policy and, more generally, the influence of theory on government policymaking. The volume addresses some of the most compelling challenges of our times, from the global financial crisis and sub-prime mortgage breakdown to corruption control and the design of interventions to provide subsidized food to the disadvantaged segments of society.","shortDescription":"The volume addresses some of the most compelling challenges of our times, from the global financial crisis and sub-prime mortgage breakdown to corruption control and the design of interventions to provide subsidized food to the ...","authors":["Kaushik Basu"],"publisher":"Oxford University Press","publishedDate":"2018-10-04","isbn":"0199093814","pageCount":328,"price":24.32,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=r1ZxDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=r1ZxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"826sAgAAQBAJ","title":"Economics and Diversity","category":"Business & Economics","description":"The bulk of contemporary economics assumes rather than explains differences between people or groups of people. Yet, many of these differences are produced by society or they imply differing opportunities and outcomes. This book argues that economists should concern themselves with the explanation of the social causes and effects of such differences. D’Ippoliti introduces the concept of diversity to summarise all differences that are of social origin and that a theory or model seeks to explain. This contrasts with the traditional concept of heterogeneity that instead refers to differences that are deemed to be exogenous of economic theory. In approaching this, the book ranges from the fields of methodology and history of economics to applied empirical work, as well as gender diversity which is considered in depth. The analysis of the thinking of two major economists of the past, John Stuart Mill and Gustav Schmoller, demonstrates how gender diversity exemplifies some of the fundamental issues in economics, such as the division of labour, society’s capacity to reproduce itself, and the role of social institutions and their impact on individual and collective behaviour. The book maintains that growth of GDP and of the services sector cannot be trusted to automatically bring about greater inclusion of women in the labour market. Active policy interventions are needed, spanning from the removal of discrimination to the provision of public services and the establishment of fair competition in the market, along with an improved division of social and political power between the sexes. This work will be of interest to researchers and students focusing on the history of economic thought, labour economics, social policy and gender studies.","shortDescription":"This work will be of interest to researchers and students focusing on the history of economic thought, labour economics, social policy and gender studies.","authors":["Carlo D'Ippoliti"],"publisher":"Routledge","publishedDate":"2011-05-15","isbn":"1136718834","pageCount":272,"price":35.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=826sAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=826sAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"X1-1DwAAQBAJ","title":"Patrick Suppes, Economics, and Economic Methodology","category":"Business & Economics","description":"Patrick Suppes (1922–2014) was an extraordinarily wide-ranging scholar. Although best known as a philosopher of science, Suppes made substantial contributions to a remarkably wide range of different fields of research including many relevant to economics: decision theory, philosophy of economics, modeling theory, foundations of measurement, philosophy of psychology (and thus what is now behavioral economics), and many other fields. This collection recognizes Suppes’s contributions to economics and economic methodology with a symposium of papers that examine, build on, and/or assess Suppes’s research in these areas. The authors include philosophers, economists, game theorists, historians of economics, and many whose research combine these fields. This book honors Patrick Suppes, while at the same time, exhibiting the richness of contemporary philosophy of economics. It was originally published as a special issue of the Journal of Economic Methodology.","shortDescription":"This book honors Patrick Suppes, while at the same time, exhibiting the richness of contemporary philosophy of economics. It was originally published as a special issue of the Journal of Economic Methodology.","authors":["John B. Davis","D. Wade Hands"],"publisher":"Routledge","publishedDate":"2018-12-07","isbn":"1351381644","pageCount":114,"price":28.89,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=X1-1DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=X1-1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"MEWHDwAAQBAJ","title":"Public Economics","category":"Business & Economics","description":"Today, the most pressing challenges for public economics are of macroeconomic nature: pensions, debt, income distribution, and fiscal sustainability. All these problems are compounded by the phenomenon of demographic transition and aging. This graduate textbook addresses these issues with the help of state-of-the-art macroeconomic tools that are based on a sound microfoundation and rooted in empirical evidence. Different from the standard partial-equilibrium analysis in traditional textbooks on public economics, the concept of general equilibrium helps to account for compensating or amplifying side-effects of economic policy. GAUSS and MATLAB computer code as well as teaching material (slides) are available as downloads from the author's homepage.","shortDescription":"Today, the most pressing challenges for public economics are of macroeconomic nature: pensions, debt, income distribution, and fiscal sustainability.","authors":["Burkhard Heer"],"publisher":"Springer","publishedDate":"2019-02-08","isbn":"3030009890","pageCount":388,"price":66.77,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=MEWHDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=MEWHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"ku6_DwAAQBAJ","title":"The Principle of Trading Economics","category":"Business & Economics","description":"This book is devoted to establishing a completely new concept within economics referred to as \"trading economics\" which is a reconstructed economic system in theory that seeks perfect harmony between micro and macro elements in a structured way, hence making the economic theory a rigorous system supported by internal logical continuity. Representing a revolution of the existing theoretical framework, trading economics has changed the logic of mainstream economics. Specifically, it deduces the \"macro whole\" from the \"micro individuals\", and it introduces a systematic and comprehensive analysis approach. It stresses that within an interconnected world, the interaction between trading agents is the fundamental driving force behind the operation, development and evolution of the economic system.","shortDescription":"This book is devoted to establishing a completely new concept within economics referred to as &quot;trading economics&quot; which is a reconstructed economic system in theory that seeks perfect harmony between micro and macro elements in a structured ...","authors":["Zhenying Wang"],"publisher":"Springer Nature","publishedDate":"2019-11-23","isbn":"9811503796","pageCount":808,"price":63.06,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ku6_DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ku6_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"ZtmPvc97dPIC","title":"Financial Accounting (Principles and Practices)","category":"Business & Economics","description":"Part I :Fundamentals * Financial Accounting: An Overview * Accounting Postulates, Concepts And Principles Part Ii : Accounting Records And Systems * Accounting Equation And Transaction Analysis * Accounting Mechanics I : Journals * Cash Book And Subsidiary Books * Accounting Mechanics Ii : Ledger Posting And Trial Balance * Bank Reconciliation Statement * Errors And Their Rectifications * Preparation Of Financial Statements : Profit And Loss Account And Balance Sheet * Depreciation Accounting * Inventory Valuation Part Iii : Company Accounts * Accounting For Shares * Accounting For Debentures * Company Final Accounts * Accounting For Amalgamation * Valuation Of Goodwill Part Iv : Financial Analysis * Statement Of Changes In Financial Position * Cash Flow Statement * Financial Statement Analysis Part V : Specialised Topics * Corporate Financial Reporting * Computerised Accounting (How To Use Tally)","shortDescription":"Part I :Fundamentals * Financial Accounting: An Overview * Accounting Postulates, Concepts And Principles Part Ii : Accounting Records And Systems * Accounting Equation And Transaction Analysis * Accounting Mechanics I : Journals * Cash ...","authors":["Lal Jawahar & Seema Srivastava"],"publisher":"S. Chand Publishing","publishedDate":"2004-08","isbn":"9788121923064","pageCount":669,"price":14.69,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ZtmPvc97dPIC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ZtmPvc97dPIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"IWoIzBbo218C","title":"Research in Accounting Regulation","category":"Business & Economics","description":"The scope of service provided by professional accountants is influenced by legislation and case law as well as the dictates of a variety of government and private sector agencies; including State Boards of Accountancy, Academic Accreditation Bodies, the United States Securities and Exchange Commission, independent standard setting bodies such as the Federal Accounting Standards Advisory Board [US], the Financial Accounting Standards Board [US], and self-regulatory organizations such as State Societies of CPAs and the American Institute of Certified Public Accountants. There are equivalent and emerging national bodies that exist in most developed and developing countries, and further there are emerging global coordinating entities as well, which attempt to coordinate the activities among nations. It is important for academics, students, practitioners, regulators and researchers to consider, study and understand the role and relationship of such bodies with the practice and content of our discipline. Research in Accounting Regulation is a refereed annual serial that seeks to publish high quality manuscripts, which address regulatory issues and policy affecting the practice of accountancy, broadly defined. Topics of interest include research based upon: self-regulatory activities, case law and litigation, government and quasi-governmental regulation, and the economics of regulation, including modeling. The serial aims to encourage the submission of original empirical, behavioral or applied research manuscripts that consider strategic and policy implications for regulation, regulatory models and markets.","shortDescription":"Research in Accounting Regulation is a refereed annual serial that seeks to publish high quality manuscripts, which address regulatory issues and policy affecting the practice of accountancy, broadly defined.","authors":["Gary Previts"],"publisher":"Elsevier","publishedDate":"2000-12-20","isbn":"9780080546247","pageCount":310,"price":64.68,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=IWoIzBbo218C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=IWoIzBbo218C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"aUtWBQAAQBAJ","title":"Financial Management and Accounting in the Public Sector","category":"Business & Economics","description":"The impact of the global financial crisis on government funds has been significant, with squeezed budgets having to satisfy ever-increasing demands for public services. Managers working in the public sector are confronted daily with targets and demands that are often set in confusing accounting and financial language. In Financial Management and Accounting in the Public Sector, Gary Bandy employs a clear and concise narrative to introduce the core concepts of accounting and financial management in the public sector and how to deliver services that represent value for money. This second edition has been revised and updated throughout, offering: an increased focus on post-crisis austerity more international examples of public financial management greater coverage of governance, accountability and risk management With a glossary of terms to help managers understand and be understood by accountants, as well as learning objectives, case studies and discussion questions, this practical textbook will help students of public management and administration to understand the financial and accounting aspects of managing public services.","shortDescription":"This second edition has been revised and updated throughout, offering: an increased focus on post-crisis austerity more international examples of public financial management greater coverage of governance, accountability and risk management ...","authors":["Gary Bandy"],"publisher":"Routledge","publishedDate":"2014-11-13","isbn":"1317659236","pageCount":406,"price":42.45,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=aUtWBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=aUtWBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"_N_yCQAAQBAJ","title":"Financial Accounting","category":"Business & Economics","description":"This book presents empirical evidence on the convergence of financial and management accounting in the Italian context. The author provides an overview of the development paths of financial accounting including its evolution, role of non-financial, forward looking and voluntary disclosures, and internal determinants such as corporate governance and business culture. The author uses the premises of agency, signalling, legitimacy and institutional theories in understanding this evolution, and includes the perspective of professional associations and academics on the topic. Based on survey data, the reader is provided with valuable insights into the Italian accounting scene.","shortDescription":"This book presents empirical evidence on the convergence of financial and management accounting in the Italian context.","authors":["Sara Trucco"],"publisher":"Springer","publishedDate":"2015-06-19","isbn":"3319187236","pageCount":143,"price":48.22,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=_N_yCQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=_N_yCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"ZQIaEAAAQBAJ","title":"Accounting Disrupted","category":"Business & Economics","description":"Accounting Disrupted: How Digitalization is changing Finance delivers a powerful analysis of the new technological forces buffeting the accounting profession and identifies key pathways to responding to the challenges. Al Bhimani, distinguished accountant, academic, and author, shows readers how established business fundamentals are being eclipsed and that accounting has not been spared. You'll learn: How the new realities of digitalization, including big data and AI, are affecting audit work and financial management practices How learning fast about and from more diverse data sources is essential to the new accounting environment Why accounting information must start to speak to what will take place rather than about financial activities that have occurred What finance must do in a world of changing risks, data growth, fast digitization, and increased regulation The author makes a compelling case that accounting now faces a crunch: it needs to reshape itself from the core because conventional financial analysis is proving too cumbersome and slow for executives in digitalized organizations. In a straightforward and illustrated style packed with case studies and practical examples, he shows readers how big data, blockchain, robotic process automation, and artificial intelligence, can help accountants adapt to new realities. Perfect for finance leaders in both the private and public sectors, Accounting Disrupted also belongs on the bookshelves of accounting students who wish to better prepare for the technological and professional environment in which they’ll shortly find themselves.","shortDescription":"This is a must-read for CFOs, other C-suite executives, and anyone working in the financial management domain.” —Anthony Pember, Managing Director, Grant Thornton Public Sector LLC","authors":["Al Bhimani"],"publisher":"John Wiley & Sons","publishedDate":"2021-02-04","isbn":"1119720117","pageCount":192,"price":22.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ZQIaEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ZQIaEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"eV5NcPYP45EC","title":"Essays in Accounting Theory in Honour of Joel S. Demski","category":"Business & Economics","description":"The integration of accounting and the economics of information developed by Joel S. Demski and those he inspired has revolutionized accounting thought. This volume collects papers on accounting theory in honor of Professor Demski. The book also contains an extensive review of Professor Demski’s own contributions to the theory of accounting over the past four decades.","shortDescription":"2.1.3 Cost <b>accounting</b> Cost <b>accounting</b> began to develop at the beginning of the twentieth century. During the nineteenth century, most &quot;cost&quot; information was gathered by engineers outside the <b>accounting</b> process.","authors":["Rick Antle","Pierre Jinghong Liang","Froystein Gjesdal"],"publisher":"Springer Science & Business Media","publishedDate":"2007-02-15","isbn":"0387303995","pageCount":326,"price":89.03,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=eV5NcPYP45EC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=eV5NcPYP45EC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"ZeVcYteHJKcC","title":"Accounting Workbook For Dummies","category":"Business & Economics","description":"Balance the books -- without all the headaches! Trying to get certified and become an accountant? Own a small business but need a little help balancing your books? Don't worry! This hands-on guide provides the learning and vital practice you need to master important accounting concepts and basics. Perfect as a companion workbook for Accounting For Dummies -- or any other accounting textbook -- Accounting Workbook For Dummies gives you a wealth of real-world examples, demonstration problems, and handy exercises. With this helpful resource as your guide, you'll master balance sheets, income statements, and budgets in no time! 100s of Problems! * Record transactions, track costs, and manage accounts * Open and close bookkeeping cycles * Analyze business performance and profit * Choose the right accounting method * Master investment accounting fundamentals * Understand manufacturing cost accounting","shortDescription":"Balance the books, learn important accounting concepts, and master the basics Accounting Workbook For Dummies is for business bookkeepers and accountants, who need a refresher on the subject, as well as students taking their first ...","authors":["John A. Tracy"],"publisher":"John Wiley & Sons","publishedDate":"2011-08-08","isbn":"9781118053065","pageCount":320,"price":13.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ZeVcYteHJKcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ZeVcYteHJKcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"vUMoEAAAQBAJ","title":"Accounting Ethics Education","category":"Business & Economics","description":"Accounting education ought to prepare future professionals to enter a principles-based, rules-oriented field of activity wherein technical knowledge of accounting standards (principles, rules and decision procedures) and ethical awareness (the capacity to discern moral issues and resolve ethical dilemmas) are crucial. Accounting education is best performed by the accountant’s adherence to the principles of the accounting profession and by individuals and firms following the appropriate rules, act according to the codes of conduct adopted by their profession, exercise clear judgment whenever they address financial transactions and consider/assess the state of a given business. Accounting Ethics Education: Making Ethics Real gathers a diversity of contributions from invited well-known experts and other specialists. It promotes comprehensive reflection around key trends, discussing and highlighting the most updated research on accounting ethics education, being an essential and useful reference in the field. In the performance of accounting tasks, the accountant should be educated and supported in the skills development and habit formation to solve accounting problems, recognize moral issues and resolve ethical dilemmas that will be encountered in their special tasks. Also, this book provides a moral map for identifying and acting on values when difficult situations arise. Examining multiple perspectives, the book improves the scholarly debate by providing cutting-edge and insightful research vital for all those interested and immersed in these matters. It will be of great value to academics, students, researchers and professionals in the fields of accounting, accounting education and ethics.","shortDescription":"Position statements on <b>accounting</b> education (Albrecht &amp; Sack, 2000; American Institute of Certified Public <b>Accountants</b> (AICPA), 2018; <b>Accounting</b> Education Change Commission (AECC), 1990; AICPA &amp; AAA, 2012; Arthur Andersen et al.,&nbsp;...","authors":["Alberto J. Costa","Margarida M. Pinheiro"],"publisher":"Routledge","publishedDate":"2021-06-03","isbn":"1000399869","pageCount":222,"price":28.89,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=vUMoEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=vUMoEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"JZ36DwAAQBAJ","title":"Management and Cost Accounting","category":"Business & Economics","description":"Management and cost accounting has been the basic toolbox in business administration for decades. Today it is an integral part of all curricula in business education and no student can afford not to be familiar with its basic concepts and instruments. At the same time, business in general, and management accounting in particular, is becoming more and more international. English clearly has evolved as the \"lingua franca\" of international business. Academics, students as well as practitioners exchange their views and ideas, discuss concepts and communicate with each other in English. This is certainly also true for cost accounting and management accounting. Management Accounting is becoming increasingly international. \"Management and Cost Accounting\" is a new English language textbook covering concepts and instruments of cost and management accounting at an introductory level (Bachelor, but also suited for MBA courses due to strong focus on practical applications and cases). This textbook covers all topics that are relevant in management accounting in business organizations and that are typically covered in German and Central European Bachelor classes on cost accounting and management accounting. After an introduction to the topic, including major differences between the German approach and the purely Anglo-Saxon approach of management accounting, the book describes different cost terms and concepts applied in German cost accounting, The book is much more specific here compared to US-American standard textbooks. Based on different cost concepts, the topic of cost behavior is discussed, including the determination of cost functions. The heart of the book guides the reader through the general structure of a fully developed cost accounting system following the German and Central European standard: It starts with cost type accounting, moves on to cost center accounting and finally deals with cost unit accounting, assigning cost to goods and services offered in the market. The remaining parts of the book deal with decision making and how management and cost accounting data can support managers in this task. A comparison of absorption costing and variable costing introduces the reader to management decisions such as product portfolio and outsourcing decisions. Additionally, cost-volume-profit analysis (break-even-analysis) is covered. The book closes with a comprehensive treatment of cost planning and variance analysis.","shortDescription":"In other countries, tax <b>accounting</b> and financial <b>accounting</b> are separate. Special accounts have to be filed for tax purposes. This sounds inefficient? Why the double work? The problem is that the objective of financial <b>accounting</b> is&nbsp;...","authors":["Andreas Taschner","Michel Charifzadeh"],"publisher":"John Wiley & Sons","publishedDate":"2020-09-01","isbn":"3527832815","pageCount":318,"price":30.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=JZ36DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=JZ36DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"Siu7DwAAQBAJ","title":"Italian Business Law","category":"Business & Economics","description":"This book offers a concise introduction to italian business law for students, scholars and legal practitioners. It contains a presentation of the theory of the enterprise and its connections with company law, in an effort to move these concepts closer to the understading of international readers. The Authors have long since specialised in lecturing italian business law to international students at Bocconi University in Milan and this book owes much to their academic exeperience. However, given the complexit of the subject matter at stake, the Authors have also leveraged on thier experience as international business lawyers in order to keep the explanation plain and practical to any possible extent.","shortDescription":"This book offers a concise introduction to italian business law for students, scholars and legal practitioners.","authors":["Alessandro De Nicola","Marco Carone"],"publisher":"EGEA spa","publishedDate":"2010-11-22T00:00:00+01:00","isbn":"8823871441","pageCount":292,"price":17.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Siu7DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Siu7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"Fu5wDwAAQBAJ","title":"Business Law","category":"Business & Economics","description":"Titles in Barron’s Business Review series are widely used as classroom supplements to college textbooks and often serve as a main textbook in business brush-up programs. Business Law focuses on the importance of legal theory in the everyday business world, explaining such subjects as tort responsibility, government regulations, contracts, environmental law, product liability, consumer protection, and international law, among many other topics. Also discussed in detail are the legal aspects of partnerships, franchises, and corporations, as well as special topics that include business crimes, property as a legal concept, intellectual property, and similar pertinent topics. A study aid labeled Key Terms appears at the beginning of each chapter, and You Should Remember summaries are strategically interspersed throughout the text.","shortDescription":"A study aid labeled Key Terms appears at the beginning of each chapter, and You Should Remember summaries are strategically interspersed throughout the text.","authors":["Robert W. Emerson"],"publisher":"Simon and Schuster","publishedDate":"2016-01-04","isbn":"1438067895","pageCount":800,"price":12.6,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Fu5wDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Fu5wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"4_0uDwAAQBAJ","title":"ACCA F4 Corporate and Business Law (Global)","category":"Business & Economics","description":"BPP Learning Media is an ACCA Approved Content Provider. Our partnership with ACCA means that our Study Texts, Practice & Revision Kits and iPass (for CBE papers only) are subject to a thorough ACCA examining team review. Our suite of study tools will provide you with all the accurate and up-to-date material you need for exam success.","shortDescription":"BPP Learning Media is an ACCA Approved Content Provider.","authors":["BPP Learning Media"],"publisher":"BPP Learning Media","publishedDate":"2017-02-17","isbn":"1509709819","pageCount":386,"price":24.37,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=4_0uDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=4_0uDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"5wI8BQAAQBAJ","title":"Business Math Formulas","category":"Business & Economics","description":"This Business Math Formulas study guide is created by Pamphlet Master for students everywhere. This tool has a comprehensive variety of college and graduate school topics/subjects which can give you what it takes to achieve success not only in school but beyond. Included in the pamphlet are: - Business Mathematics - What is Business Math? - Calculating Profit Percentage - How to Calculate Cost - Profit and Loss - Discount Rates - Interest Rate","shortDescription":"<b>Business Mathematics Business mathematics</b> as the term states is related to business which involves mainly profit, loss and interest. This page is designed to provide you the best help with these basic topics.","authors":["Pamphlet Master"],"publisher":"Speedy Publishing LLC","publishedDate":"2014-08-04","isbn":"1635010853","pageCount":5,"price":3.04,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=5wI8BQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=5wI8BQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"Ad5xEAAAQBAJ","title":"Business Mathematics For MBAs","category":"Business & Economics","description":"A concise eBook for the self-learner. The book covers the essential mathematical content for any student considering, or taking an MBA degree. All of the topics appear in a typical MBA program. Every chapter has practice questions, linked to video solutions.","shortDescription":"Though the original notes on which the eBook is based were developed to be used in conjunction with the video course, I believe that students will find the eBook useful in its own right as a stand-alone self-study <b>business math</b> course.","authors":["Richard Waterman"],"publisher":"Richard Waterman","publishedDate":"2015-03-28","isbn":"0990497917","pageCount":350,"price":20.83,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Ad5xEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Ad5xEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"Dah5EAAAQBAJ","title":"A Guide to Business Mathematics","category":"Business & Economics","description":"The success of business today is dependent on the knowledge and expertise of its employees. The need for mathematics arises naturally in business such as in the work of the actuary in an insurance company, the financial mathematics required in the day-to-day work of the banker and the need to analyse data to extract useful information to enable the business to make the right decisions to be successful. A Guide to Business Mathematics provides a valuable self-study guide to business practitioners, business students and the general reader to enable them to gain an appropriate insight into the mathematics used in business. This book offers an accessible introduction to essential mathematics for the business field. A wide selection of topics is discussed with the mathematical material presented in a reader-friendly way. The business context motivates the presentation. The author uses modelling and applications to motivate the material, demonstrating how mathematics is used in the financial sector. In addition to the role of the actuary and the banker, the book covers operations research including game theory, trade discounts and the fundamentals of statistics and probability. The book is also a guide to using metrics to manage and measure performance, and business economics. Foundations on algebra, number theory, sequences and series, matrix theory and calculus are included as is a complete chapter on using software. Features • Discusses simple interest and its application to promissory notes/treasury bills. • Discusses compound interest with applications to present and future values. • Introduces the banking field including loans, annuities and the spot/forward FX market. • Discusses trade discounts and markups/markdowns. • Introduces the insurance field and the role of the actuary. • Introduces the fields of data analytics and operations research. • Discusses business metrics and problem solving. • Introduces matrices and their applications. • Discusses calculus and its applications. • Discusses basic financial statements such as balance sheet, profit and loss and cash account. • Reviews a selection of software to support business mathematics. This broad-ranging text gives the reader a flavour of the applications of mathematics to the business field and stimulates further study in the subject. As such, it will be of great benefit to business students, while also capturing the interest of the more casual reader. About the Author Dr. Gerard O'Regan is an Assistant Professor in Mathematics at the University of Central Asia in Kyrgyzstan. His research interests include software quality and software process improvement, mathematical approaches to software quality, and the history of computing. He is the author of several books in the Mathematics and Computing fields.","shortDescription":"20.3 Maple Maple is <b>math</b> software that includes a powerful <b>math</b> engine and a user interface that makes it easy to analyse, explore, visualize and solve <b>mathematical</b> problems. It allows problems to be solved easily and quickly in most&nbsp;...","authors":["Gerard O'Regan"],"publisher":"CRC Press","publishedDate":"2022-08-23","isbn":"1000634914","pageCount":412,"price":53.95,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Dah5EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Dah5EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"ntUxEAAAQBAJ","title":"Javascript for R","category":"Business & Economics","description":"Little known to many, R works just as well with JavaScript—this book delves into the various ways both languages can work together. The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow. In that respect the book is not teaching one JavaScript but rather we show how little JavaScript can greatly support and enhance R code. Therefore, the focus is on integrating external JavaScript libraries and no prior knowledge of JavaScript is required. Key Features: ● Easy to pick up. ● An entry way to learning JavaScript for R. ● Covers topics not covered anywhere else. ● Easy to follow along.","shortDescription":"The ultimate aim of this work is to put the reader at ease with inviting JavaScript in their data science workflow.","authors":["John Coene"],"publisher":"CRC Press","publishedDate":"2021-07-15","isbn":"1000408175","pageCount":354,"price":34.32,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=ntUxEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=ntUxEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]