[{"bookId":"yNLlDwAAQBAJ","title":"Cambridge IGCSE and O Level Computer Science Second Edition","category":"Education","description":"This title is endorsed by Cambridge Assessment International Education to support the full syllabus for examination from 2023. Benefit from the knowledge of our renowned expert authors to navigate through the content of the updated Cambridge IGCSETM and O Level Computer Science syllabuses (0478/0984/2210). - Develop computational thinking and problem-solving skills: clearly-explained concepts are followed by opportunities to implement in the programming language of choice. - Build an understanding of computer systems and associated technologies: carefully prepared worked examples explain new ideas alongside activities to test and consolidate. - Navigate the syllabus confidently: supplementary subject content is flagged clearly, with introductions to each topic outlining the learning objectives. - Satisfy curiosity: students are encouraged to deepen their knowledge and understanding of the subject with Extension Activities and Find Out More. - Consolidate skills and check understanding: self-assessment questions, activities and exam-style questions are embedded throughout the book, alongside key definitions of technical terms and a glossary. Answers to the Student Book are available in Cambridge IGCSE and O Level Computer Science Teacher's Guide with Boost Subscription 9781398318502","shortDescription":"Answers to the Student Book are available in Cambridge IGCSE and O Level Computer Science Teacher&#39;s Guide with Boost Subscription 9781398318502","authors":["David Watson","Helen Williams"],"publisher":"Hachette UK","publishedDate":"2021-04-16","isbn":"1398320757","pageCount":352,"price":19.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=yNLlDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=yNLlDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"bKOLAgAAQBAJ","title":"Teaching World History as Mystery","category":"Education","description":"Offering a philosophy, methodology, and examples for history instruction that are active, imaginative, and provocative, this text presents a fully developed pedagogy based on problem-solving methods that promote reasoning and judgment and restore a sense of imagination and participation to classroom learning. It is designed to draw readers into the detective process that characterizes the work of professional historians and social scientists ─ sharing raw data, defining terms, building interpretations, and testing competing theories. An inquiry framework drives both the pedagogy and the choice of historical materials, with selections favoring the unsolved, controversial, and fragmented rather than the neatly wrapped up analysis of past events. Teaching World History as Mystery: Provides a balanced combination of interestingly arranged historical content, and clearly explained instructional strategies Features case studies of commonly and not so commonly taught topics within a typical world/global history curriculum using combinations of primary and secondary documents Discusses ways of dealing with ethical and moral issues in world history classrooms, drawing students into persisting questions of historical truth, bias, and judgment","shortDescription":"Why arethere fewerwomen than menin world <b>history</b> books? What are the reasons for secret societies arising? How canwe draw conclusions from artifacts alone? What formsof communication are most influential andpowerful?","authors":["Jack Zevin","David Gerwin"],"publisher":"Routledge","publishedDate":"2010-12-07","isbn":"1135147469","pageCount":256,"price":30.58,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=bKOLAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=bKOLAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"xy24AgAAQBAJ","title":"American Educational History Journal","category":"Education","description":"The American Educational History Journal is a peer?reviewed, national research journal devoted to the examination of educational topics using perspectives from a variety of disciplines. The editors of AEHJ encourage communication between scholars from numerous disciplines, nationalities, institutions, and backgrounds. Authors come from a variety of disciplines including political science, curriculum, history, philosophy, teacher education, and educational leadership. Acceptance for publication in AEHJ requires that each author present a well?articulated argument that deals substantively with questions of educational history.","shortDescription":"In his <b>History</b> of the Greek Nation, Constantine Paparrigopoulos had placed ancient Greek <b>history</b> within the broader <b>historical</b> framework of Greek <b>history</b>. To Paparrigopoulos Greek <b>history</b> stretched from the ancient Greek past,&nbsp;...","authors":["Paul J. Ramsey"],"publisher":"IAP","publishedDate":"2013-08-01","isbn":"1623964237","pageCount":417,"price":86.56,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=xy24AgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=xy24AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"8x2vDAAAQBAJ","title":"Geography of Education","category":"Education","description":"Geography of Education sets out the scope of this emergent, interdisciplinary field. It illustrates the essential affinity of geographical and educational studies, by emphasising the geographical factors influencing formal education systems and other forms of knowledge transfer. Colin Brock begins by arguing the theoretical synergy that exists between the nature of both geography and educational studies as disciplines. This is then exemplified by an analysis of the emergence of systems of schooling under the influence of religious, political and economic forces. The author also considers informal and non-formal modes of education, and argues that the huge diversity of such provision creates a rich resource for research into geographies of education. In the final chapters the author turns his attention to the role of cyberspace, which has its own geography, in learning, and considers education as a form of humanitarian response to issues of environmental sustainability. By bringing together a wide range of themes and topics relating to both education and geography, Colin Brock argues that the geographical approach should inform the evolution of all types of educational provision around the world.","shortDescription":"Table 1.2 Geographies and education in four journals since 1990 Type of <b>Geography</b> Area Transactions <b>Geography</b> GJ a) The Nature of <b>Geography</b> 35 14 20 18 b) <b>Geography</b> of Geographies 41 17 12 24 c) Children&#39;s Geographies 19 5 11 1 d)&nbsp;...","authors":["Colin Brock"],"publisher":"Bloomsbury Publishing","publishedDate":"2016-09-22","isbn":"1474223257","pageCount":240,"price":26.78,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=8x2vDAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=8x2vDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"4qFMqjxte9IC","title":"The Social Studies Curriculum","category":"Education","description":"This updated third edition contains new chapters on important issues—including race, gender, sexuality, and multiculturalism—affecting social studies education.","shortDescription":"E. Wayne Ross The content of the <b>social studies</b> curriculum is the most inclusive of all school subjects. Stanley and Nelson define social education as “the study of all human enterprise over time and space” (1994, p. 266).","authors":["E. Wayne Ross"],"publisher":"SUNY Press","publishedDate":"2012-02-01","isbn":"0791481042","pageCount":368,"price":34.58,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=4qFMqjxte9IC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=4qFMqjxte9IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"2uE2DwAAQBAJ","title":"The Idea of a Social Studies Education","category":"Education","description":"Offering a fresh take on the purpose of social studies today, James A. Duplass positions philosophical counseling as a way for teachers to engage students in thinking deeply about what it means to be a citizen in a democratic society. The Idea of a Social Studies Education takes a uniquely humanistic approach to the idea of a social studies education to show how teachers can act as philosophical counselors in preparing students for active civic engagement. Duplass reminds the reader of the needs of students in modern society who seek to develop an identity worth living and the role social studies can play in students achieving that process. By focusing on the cultivation of students’ autonomy, authenticity, efficacy, and agency, Duplass’ approach avoids political biases and instead encourages critical thinking to decipher what a democratic ideology truly is.","shortDescription":"research in <b>social studies</b> education (pp. 50–64). New York: Routledge. Lincoln, A. (1863). The Gettysburg address. Retrieved from http://www.abrahamlincolnonline.org/lincoln/speeches/gettysburg.htm. McClellan, B. E. (1999).","authors":["James A. Duplass"],"publisher":"Routledge","publishedDate":"2017-09-22","isbn":"1315448424","pageCount":216,"price":31.43,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=2uE2DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=2uE2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"GboEAQAAQBAJ","title":"Differentiating Assessment in Middle and High School English and Social Studies","category":"Education","description":"This book by Sheryn Spencer Waterman follows the bestselling Handbook on Differentiated Instruction for Middle and High Schools. With numerous examples and strategies, it is an all-inclusive manual on assessing student readiness, interests, learning and thinking styles. It includes examples of Pre-, Formative and Summative assessments Informal and formal assessments Oral and written assessments Project and performance assessments Highly structured and enrichment assessments for struggling to gifted students Assessment tools and rubrics","shortDescription":"HowisEnglish useful when we study other subjects such as <b>social studies</b>, science, or geography? • Why isit important tobe able to closely analyze literature? • Why isit important touse conventions of grammar and spelling when wewrite?","authors":["Sheryn Spencer-Waterman"],"publisher":"Routledge","publishedDate":"2013-09-27","isbn":"1317924282","pageCount":208,"price":14.09,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=GboEAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=GboEAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"FSIjAQAAQBAJ","title":"Assessing Middle and High School Social Studies & English","category":"Education","description":"For middle and high school teachers teachers of social studies and English, this book is filled with examples of instructional strategies that address students’ readiness levels, interests, and learning preferences. It shows teachers how to formatively assess their students by addressing differentiated learning targets. Included are detailed examples of differentiated formative assessment schedules plus tips on how to collaborate with others to improve assessment processes. Teachers will learn how to adjust instruction for the whole class, for small groups, and for individuals. They will also uncover step-by-step procedures for creating their own lessons infused with opportunities to formatively assess students who participate in differentiated learning activities.","shortDescription":"teacher to assess typical students&#39; learning <b>social studies</b> content as wellasa decisionmaking process thatmight applytoother problems. Inthis example,the teacher presentsthe problem. ♢Adjustment forgifted or highly advanced learners:&nbsp;...","authors":["Sheryn Spencer-Waterman"],"publisher":"Routledge","publishedDate":"2013-10-02","isbn":"1317924525","pageCount":144,"price":17.06,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=FSIjAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=FSIjAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"uUdOAwAAQBAJ","title":"100 Experiential Learning Activities for Social Studies, Literature, and the Arts, Grades 5-12","category":"Education","description":"Facilitates student engagement through active learning and provides easy-to-use matrices linking McREL, NCTE, and NCSS standards to activities in history, economics, literature, and the arts.","shortDescription":"Matrix of Activities Correlated to the National Council of <b>Social Studies</b> (NCSS) Standards NCSS standards available at http://www.<b>socialstudies</b>.org/standards/strands/ X X Civic Ideals &amp; Practices X X.","authors":["Eugene F. Provenzo, Jr.","Dan W. Butin","Anthony Angelini"],"publisher":"Corwin Press","publishedDate":"2008-02-13","isbn":"1452293988","pageCount":176,"price":22.06,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=uUdOAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=uUdOAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"RQtpDwAAQBAJ","title":"Essentials of Middle and Secondary Social Studies","category":"Education","description":"Building on the success of the first edition, Essentials of Middle and Secondary Social Studies 2nd Edition focuses on the key issues central to the teaching of middle and high school social studies, including lesson planning and instructional strategies. Written in an engaging, conversational style, the text encourages teachers in their development as professionals and enables them to effectively use creative and active learning strategies in the everyday classroom. NEW TO THIS EDITION This second edition has been significantly refined with new and relevant topics and strategies needed for effectively teaching middle and secondary social studies. New features include: An updated chapter on lesson plans, in keeping with the book’s emphasis on planning and teaching. This chapter is designed to provide middle and secondary teachers with new classroom-tested lesson plans and includes two classroom-tested lessons for each grade level (6-12). An expanded chapter on planning. This chapter provides additional discussion about long-range planning and includes examples of lesson plans with details to help students be better prepared. An updated chapter on technology designed to better prepare middle and secondary teachers to effectively incorporate technology into social studies instruction. Attention is given to digital history, media literacy, teaching with film and music, popular apps and numerous other types of impactful technology. \"FYI\" callouts throughout each chapter. These callouts provide helpful information and further explanation. An expanded discussion of the Common Core Standards and C3 Framework and how they impact teachers. An updated chapter titled \"Experiencing Social Studies.\" This chapter focuses on topics such as teaching with drama, role play, field trips, and service learning. A \"Helpful Resources\" section that details various websites and online resources for further discovery.","shortDescription":"NEW TO THIS EDITION This second edition has been significantly refined with new and relevant topics and strategies needed for effectively teaching middle and secondary social studies.","authors":["William B. Russell III","Stewart Waters","Thomas N. Turner"],"publisher":"Routledge","publishedDate":"2018-08-06","isbn":"0429866933","pageCount":326,"price":31.43,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=RQtpDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=RQtpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"7i7xCgAAQBAJ","title":"100 Social Studies Report Ideas","category":"Education","description":"These 100 social studies research topics will challenge students and stimulate their interest. They can be used as is or be adapted and used to inspire new ideas. They cover culture, economics, exploration and migration, geography, government and politics, history, labor, people, and religion.","shortDescription":"These 100 social studies research topics will challenge students and stimulate their interest.","authors":["Patricia Lewis","Peter Watson"],"publisher":"Milliken Publishing Company","publishedDate":"1991-09-01","isbn":"0787720755","pageCount":10,"price":3.01,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=7i7xCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=7i7xCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"824YAgAAQBAJ","title":"A-level Mathematics Challenging Drill Questions (Yellowreef)","category":"Education","description":"• according to syllabus for exam up to year 2020 • new questions from top schools & colleges since 2008 – 2017 • exposes “surprise & trick” questions • complete answer keys • most efficient method of learning, hence saves time • arrange from easy-to-hard both by topics and question-types to facilitate easy absorption • full set of step-by-step solution approaches (available separately) • advanced trade book • complete and concise eBook editions available • also suitable for • Cambridge GCE AL (H1/H2) • Cambridge International A & AS Level • Books available for other subjects including Physics, Chemistry, Biology, Mathematics, Economics, English • Primary level, Secondary level, GCE O-level, GCE A-level, iGCSE, Cambridge A-level, Hong Kong DSE • visit www.yellowreef.com for sample chapters and more","shortDescription":"The syllabus prepares students adequately for university courses including <b>mathematics</b>, physics and engineering, where more <b>mathematics</b> content is required. The syllabus aims to develop <b>mathematical</b> thinking and problem solving skills&nbsp;...","authors":["Thomas Bond","Chris Hughes"],"publisher":"Yellowreef Limited","publishedDate":"2019-05-05","isbn":"0797802002","pageCount":295,"price":19.78,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=824YAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=824YAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"FQQuAAAAQBAJ","title":"How to Learn a Foreign Language","category":"Education","description":"In this entertaining and groundbreaking book, Dr. Paul Pimsleur, creator of the renowned Pimsleur Method, the world leader in audio-based language learning, shows how anyone can learn to speak a foreign language. If learning a language in high school left you bruised, with a sense that there was no way you can learn another language, How to Learn a Foreign Language will restore your sense of hope. In simple, straightforward terms, Dr. Pimsleur will help you learn grammar (seamlessly), vocabulary, and how to practice pronunciation (and come out sounding like a native). The key is the simplicity and directness of Pimsleur’s approach to a daunting subject, breaking it down piece by piece, demystifying the process along the way. Dr. Pimsleur draws on his own language learning trials and tribulations offering practical advice for overcoming the obstacles so many of us face. Originally published in 1980, How to Learn a Foreign Language is now available on the 50th anniversary of Dr. Pimsleur’s publication of the first of his first audio courses that embodied the concepts and methods found here. It's a fascinating glimpse into the inner workings of the mind of this amazing pioneer of language learning.","shortDescription":"In this entertaining and groundbreaking book, Dr. Paul Pimsleur, creator of the renowned Pimsleur Method, the world leader in audio-based language learning, shows how anyone can learn to speak a foreign language.","authors":["Pimsleur"],"publisher":"Simon and Schuster","publishedDate":"2013-09-03","isbn":"1442369035","pageCount":160,"price":12.6,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=FQQuAAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=FQQuAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"UN5CDwAAQBAJ","title":"An Introduction to Foreign Language Learning and Teaching","category":"Education","description":"An Introduction to Foreign Language Learning and Teaching provides an engaging, student-friendly guide to the field of foreign language learning and teaching. Aimed at students with no background in the area and taking a task-based approach, this book: introduces the theoretical and practical aspects of both learning and teaching; provides discussion and workshop activities throughout each chapter of the book, along with further reading and reflection tasks; deals with classroom- and task-based teaching, and covers lesson planning and testing, making the book suitable for use on practical training courses; analyses different learning styles and suggests strategies to improve language acquisition; includes examples from foreign language learning in Russian, French, and German, as well as English; is accompanied by a brand new companion website at www.routledge.com/cw/johnson, which contains additional material, exercises, and weblinks. Written by an experienced teacher and author, An Introduction to Foreign Language Learning and Teaching is essential reading for students beginning their study in the area, as well as teachers in training and those already working in the field.","shortDescription":"Aimed at students with no background in the area and taking a task-based approach, this book: introduces the theoretical and practical aspects of both learning and teaching; provides discussion and workshop activities throughout each ...","authors":["Keith Johnson"],"publisher":"Routledge","publishedDate":"2017-11-22","isbn":"1351213849","pageCount":326,"price":22.1,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=UN5CDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=UN5CDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"DhxpDwAAQBAJ","title":"Foreign Language Teaching in Romanian Higher Education","category":"Education","description":"This volume gathers recent research findings in the field of foreign language (FL) teaching in Romanian higher education dwelling on both methodology and students’ learning outcomes. The book satisfies the need for an up-to-date overview of FL teaching in Romanian universities in the European context as well as from a global international perspective. This book confers visibility to Romanian foreign language scholars’ research and it opens new paths for debate and collaboration worldwide. The scholars included in this volume have extensive expertise in the field of foreign language teaching and research in higher education which is supported by their international recognition as specialists in their specific areas. The contributing authors approach their respective chapters relying on both qualitative and quantitative research. Their experience and conclusions will prove helpful for any foreign language professional working in tertiary education.","shortDescription":"This volume gathers recent research findings in the field of foreign language (FL) teaching in Romanian higher education dwelling on both methodology and students’ learning outcomes.","authors":["Lucia-Mihaela Grosu-Rădulescu"],"publisher":"Springer","publishedDate":"2018-08-15","isbn":"3319933299","pageCount":334,"price":81.61,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=DhxpDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=DhxpDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"zGBCEAAAQBAJ","title":"Critical Pedagogies in Physical Education, Physical Activity and Health","category":"Education","description":"Critical Pedagogies in Physical Education, Physical Activity and Health explores critical pedagogy – and critical work around the body, health and physical activity – within physical education. By examining the complex relationships between policies and practice, and how these are experienced by young people, it elucidates the need for critical pedagogy in contemporary times. With contributions from leading international experts in health and physical education, and underpinned by a critical, socio-cultural approach, the book examines how health and physical education are situated across various international contexts and the influence of policy and curriculum. It explores how health is constructed by students and teachers within these contexts as well as how wider spaces and places beyond formal schooling influence learning around the body, health and physical activity. Finally, it considers what progressive pedagogies might ‘look like’ within health and physical education. Chapters utilise empirical work within the field to explore various topics of relevance to critical pedagogy, drawing on theoretical insights while providing practical applications and concluding with reflection points to encourage readers to consider the relevance for their own contexts. Designed to support pedagogical study in a range of contexts, this book will be of particular interest to undergraduate and postgraduate students, teachers and researchers with an interest in physical education, physical activity and health and the role they play in young people’s lives.","shortDescription":"Designed to support pedagogical study in a range of contexts, this book will be of particular interest to undergraduate and postgraduate students, teachers and researchers with an interest in physical education, physical activity and health ...","authors":["Julie Stirrup","Oliver Hooper"],"publisher":"Routledge","publishedDate":"2021-07-29","isbn":"1000421481","pageCount":246,"price":27.19,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=zGBCEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=zGBCEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"VjPscAouTkwC","title":"Landmarks in the History of Physical Education","category":"Education","description":"Originally published in 1957,the first part of this volume examines physical education in classical Greece and Imperial Rome during the first and second centuries A.D. and in Italy and England during the Renaissance. Each of these periods witnessed remarkable developments in the practice and theory of physical education: developments which still have present-day significance. The second part of the book traces the simultaneous development of physical education in different parts of the USA and Europe from the end of the eighteenth century onwards.","shortDescription":"Originally published in 1957,the first part of this volume examines physical education in classical Greece and Imperial Rome during the first and second centuries A.D. and in Italy and England during the Renaissance.","authors":["P C McIntosh"],"publisher":"Routledge","publishedDate":"2013-04-15","isbn":"1135030979","pageCount":240,"price":35.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=VjPscAouTkwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=VjPscAouTkwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"tdNTAQAAQBAJ","title":"Teaching Physical Education","category":"Education","description":"Designed for all trainee and newly qualified teachers, teacher trainers and mentors, this volume provides a contemporary handbook for the teaching of physical education, covering Key Stages 2, 3 and 4 in line with current DfEE and TTA guidelines.","shortDescription":"Designed for all trainee and newly qualified teachers, teacher trainers and mentors, this volume provides a contemporary handbook for the teaching of physical education, covering Key Stages 2, 3 and 4 in line with current DfEE and TTA ...","authors":["Richard Bailey"],"publisher":"Routledge","publishedDate":"2013-10-11","isbn":"1135380732","pageCount":222,"price":28.89,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=tdNTAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=tdNTAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"1aBx3pdq8l4C","title":"Equity and Inclusion in Physical Education and Sport","category":"Education","description":"An essential component of good practice in physical education is ensuring inclusivity for all pupils, regardless of need, ability or background. Now in a fully revised and updated new edition, Equity and Inclusion in Physical Education fully explores the theoretical and practical issues faced by physical education teachers today. The book amalgamates areas of critical debate within the world of physical education and is structured around the key topics of ability, special educational needs, gender, sexuality, social class, race and ethnicity. These issues are discussed in relation to principles of equity, equality of opportunity, pedagogy, differentiation, curriculum planning and cultural awareness. Other chapters explore contemporary themes such as healthism and obesity and values in physical education and policy, whilst a chapter new to this edition demonstrates the importance of reflexivity and critical self-reflection in good inclusive practice. As well as being a perfect introductory text for any course on inclusion or inclusive practice in physical education, the book offers invaluable, practical advice for established professionals, newly qualified teachers and trainees about how to meet equity and inclusion requirements. Examples of good practice are included throughout, as well as guidance on how to implement an inclusive PE curriculum within the school.","shortDescription":"Other chapters explore contemporary themes such as healthism and obesity and values in physical education and policy, whilst a chapter new to this edition demonstrates the importance of reflexivity and critical self-reflection in good ...","authors":["Gary Stidder","Sid Hayes"],"publisher":"Routledge","publishedDate":"2012-09-10","isbn":"1136478078","pageCount":240,"price":30.58,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=1aBx3pdq8l4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=1aBx3pdq8l4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"OXJ4AgAAQBAJ","title":"Young People's Voices in Physical Education and Youth Sport","category":"Education","description":"How do children and young people experience and understand sport and physical activity? What value do they attach to physical education and physical literacy? This important new book attempts to engage more directly than ever before with the experiences of young people by placing the voices of the young people themselves at the centre of the discussion. As the need to listen to young people becomes increasingly enshrined in public policy and political debate, this book illuminates our understanding of an important aspect of the everyday lives of many young people. With contributions from leading researchers and educationalists from around the world, the book draws on a diverse range of methodological and theoretical perspectives to demonstrate how we can better understand the unique perspectives of young people, how teachers and coaches can respond to and engage with the voices of young people, and how young people can be afforded opportunities to shape their education and leisure experiences. The book presents a fascinating range of case studies from around the world, including the experiences of African American girls and masculine sporting identities in Australia, and addresses both theoretical and policy debates. Young People’s Voices in Physical Education and Youth Sport is essential reading for any serious student or professional with an interest in PE, youth sport, sports development, sports coaching, physical activity and health, education or youth work.","shortDescription":"This important new book attempts to engage more directly than ever before with the experiences of young people by placing the voices of the young people themselves at the centre of the discussion.","authors":["Mary O'Sullivan","Ann MacPhail"],"publisher":"Routledge","publishedDate":"2010-07-12","isbn":"1134010605","pageCount":248,"price":39.06,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=OXJ4AgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=OXJ4AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"z3dSj4xZR38C","title":"Handbook of Physical Education","category":"Education","description":"`This is simply the physical education book of its time. The editors must be congratulated on bringing together so many quality authors from so many different parts of the world. As a handbook, it represents how far the study of physical education has moved forward in recent times. What we have is a clear portrayal of physical education at the start of the 21st century' - Mike Jess, University of Edinburgh `This Handbook is a \"must read\" for all physical educators who are serious about understanding their subject and developing their practices. The list of authors involved reads like a \"who's who\"' of physical education at a global level - the editors are to be commended on bringing together such collective expertise - this is a key strength of the book. The Handbook successfully expresses a view of knowledge about physical education pedagogy which embraces different research traditions and emerging areas of interest across the global scholarly community' - Jo Harris, Loughborough University `This comprehensive and eclectic exploration into the field of physical education draws on the vast expertise of its renowned international contributors with astounding results. The Handbook of Physical Education serves to firmly reinstate physical education to its position as the core discipline of sport and exercise science. The Handbook is destined to become an indispensable academic resource for scholars, students and enthusiasts of physical education for years to come' - Pilvikki Heikinaro-Johansson, University of Jyväskylä What is the current condition of the field of physical education? How has it adapted to the rise of kinesiology, sport and exercise science and human movement studies over the last thirty years? This Handbook provides an authoritative critical overview of the field and identifies future challenges and directions. The Handbook is divided in to six parts: - Perspectives and Paradigms in Physical Education Pedagogy Research; - Cross-disciplinary Contributions to Research on Physical Education; - Learners and Learning in Physical Education; - Teachers, Teaching and Teacher Education in Physical Education; - Physical Education Curriculum; - Difference and Diversity in Physical Education. This benchmark work is essential reading for educators and students in the field of physical education.","shortDescription":"Putting research to work in elementary <b>physical education</b>: conversations in the gym. Champaign, IL: Human Kinetics. Logan, B., Lambdin, D., Ramirez, T. and Farr, D. (2000). Documenting and verifying best practice in elementary physical&nbsp;...","authors":["David Kirk","Doune Macdonald","Mary O'Sullivan"],"publisher":"SAGE","publishedDate":"2006-09-18","isbn":"1446206998","pageCount":864,"price":22.07,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=z3dSj4xZR38C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=z3dSj4xZR38C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"3NvBDwAAQBAJ","title":"Debates in Physical Education","category":"Education","description":"This new and updated second edition of Debates in Physical Education explores issues physical education teachers encounter in their daily lives. By engaging with both established and contemporary debates, this volume challenges readers to think about and reflect on the relative validity of positions presented in order to develop their own reasoned and personal view in relation to the topics explored. Divided into four accessible sections, this book investigates and offers fresh insight into topics of central importance in physical education. Chapters include, for example: Physical education beyond schools and teachers; Physical education as a means or as an end in itself; Knowledge for physical education; The physical education curriculum; Assessment in physical education; Technology, pedagogy and physical education. Designed to stimulate discussion and support readers in their own research, writing and practice, Debates in Physical Education will be a valuable resource for any student or practising teacher engaged in initial teacher education, continuing professional development or Masters level study.","shortDescription":"of <b>physical education</b>? A review of literature&#39;, Quest, 67 (1), 56–72. Casey, A. and Larsson, H. (2018) &#39;It&#39;s groundhog day: Foucault&#39;s governmentality and crisis discourses in <b>physical education</b>&#39;, Quest, 1–18. Casey, A. and MacPhail,&nbsp;...","authors":["Susan Capel","Richard Blair"],"publisher":"Routledge","publishedDate":"2020-01-01","isbn":"0429996675","pageCount":336,"price":18.71,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=3NvBDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=3NvBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"wcKgBgAAQBAJ","title":"Becoming a Physical Education Teacher","category":"Education","description":"Teaching physical education is a challenging but rewarding occupation. Finding a way into the profession can be a daunting task while regular changes in government policy can make it hard to stay up to date. This engaging new book explains the process of becoming and being a teacher of secondary school physical education, from the various routes of entry into the profession, to the realities of being a qualified PE teacher, to the ways in which experienced teachers can become teacher educators and nurture the next generation. It combines rich personal accounts of teaching in, and being taught, physical education, with practical advice for trainees, newly qualified teachers and established professionals, with an emphasis throughout on the importance of critical self-reflection. The book begins by exploring the nature and purpose of physical education and examining the historical development of initial teacher training. It examines recent changes in training, policy and curriculum, and offers an overview of the various ways of becoming a PE teacher, including the Post Graduate Certificate in Education (PGCE) and school and employment based routes. The book offers advice on what to expect at interview, meeting the standards for qualifying to teach, and on how to survive the difficult first year as a newly-qualified teacher. It also outlines the challenges and rewards of being a qualified teacher, mentor or curriculum leader, as well as a teacher educator within higher education. Concise, helpful, and filled with sensible insights based on real experiences of teaching physical education, Becoming a Physical Education Teacher is an essential read for anybody considering entering the profession, or for students, trainees, newly qualified or experienced teachers wanting to understand better the process of becoming, and being, a successful PE teacher.","shortDescription":"operation,team work, deferred gratification, respect andfairplay. (Green 2013:56) Capeland Whitehead have argued that while <b>physical education</b>, recreationand sport are closely related to each other,they are distinctly different:&nbsp;...","authors":["Gary Stidder"],"publisher":"Routledge","publishedDate":"2015-02-11","isbn":"1317677323","pageCount":206,"price":28.89,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=wcKgBgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=wcKgBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"SjolDwAAQBAJ","title":"Digital Technologies and Learning in Physical Education","category":"Education","description":"There is evidence of considerable growth in the availability and use of digital technologies in physical education. Yet, we have scant knowledge about how technologies are being used by teachers, and whether or how these technologies are optimising student learning. This book makes a novel contribution by focusing on the ways in which teachers and teacher educators are attempting to use digital technologies in PE. The book has been created using the innovative ‘pedagogical cases’ framework. Each case centres on a narrative, written by a PE practitioner, explaining how and why technology is used in their practice to advance and accelerate learning. Each practitioner narrative is then analysed by a team of experts from different disciplines. The aim is to offer a multi-dimensional understanding of the possibilities and challenges of supporting young people’s learning with digital technologies. Each case concludes with a practitioner reflection to illustrate the links between theory, research and practice. Digital Technologies and Learning in Physical Education encourages critical reflection on the use of technologies in PE. It is an essential resource for students on physical education, kinesiology or sport science courses, practitioners working in PE or youth sport, and researchers interested in digital technologies and education.","shortDescription":"This book makes a novel contribution by focusing on the ways in which teachers and teacher educators are attempting to use digital technologies in PE. The book has been created using the innovative ‘pedagogical cases’ framework.","authors":["Ashley Casey","Victoria A. Goodyear","Kathleen M. Armour"],"publisher":"Taylor & Francis","publishedDate":"2016-11-10","isbn":"1317366298","pageCount":276,"price":35.67,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=SjolDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=SjolDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]