[{"bookId":"zW_EAwAAQBAJ","title":"Teach English as a Foreign Language: Teach Yourself (New Edition)","category":"Foreign Language Study","description":"This new edition of Teach EFL is the ultimate practical reference guide to teaching English as a Foreign Language. 'Riddell's book is a classic - it answers all those questions new language teachers have....covers an amazing amount in a clear accessible way.' David Carr, Director of Teacher Training International House London This book is packed with information on: -effective teaching techniques. -sound classroom management. -practical lesson planning. -successful job hunting and career development. This is an indispensable book for all new and experienced EFL teachers: a step-by-step guide on what to teach and how to teach it. This edition has been fully revised to include: -up-to-date information on technology as an aid to learning. -comprehensive information on the increasingly popular task-based learning. -invaluable advice on making the transition from learning to teaching. -clear guidance on ongoing professional development. -useful examples of teaching in different international contexts. Rely on Teach Yourself, trusted by learners for over 75 years.","shortDescription":"This new edition of Teach EFL is the ultimate practical reference guide to teaching English as a Foreign Language.","authors":["David Riddell"],"publisher":"Hachette UK","publishedDate":"2014-06-27","isbn":"1473601177","pageCount":288,"price":3.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=zW_EAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=zW_EAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"K0aqDwAAQBAJ","title":"Interaction in the English as a Foreign Language Classroom with a Focus on Different Tasks","category":"Foreign Language Study","description":"Seminar paper from the year 2015 in the subject English - Pedagogy, Didactics, Literature Studies, grade: 1,3, University of Frankfurt (Main), language: English, abstract: This work deals with the interaction in the English as a Foreign Language classroom with a special focus on different tasks. For future teachers it is essential to keep in mind that the use of different media in the classroom gives students the opportunity to learn foreign languages in various ways and in a meaningful context. Therefore the use of games, movies and other media is considered to be very important, because they are flexible and the students might show a higher interest in media that they already know. Students learn more easily with games, if they do not have the feeling to be learning actively. Furthermore they might already have heard of a movie or might have read the book and as a result the connection to the classroom will be more successful. It is outstanding that language in nearly every activity, task and game is used in a meaningful context, very often the intercultural communicative competence in fostered and various skills are needed.","shortDescription":"Seminar paper from the year 2015 in the subject Didactics - English - Pedagogy, Literature Studies, grade: 1,3, University of Frankfurt (Main), language: English, abstract: This work deals with the interaction in the English as a Foreign ...","authors":["Nicky Jan"],"publisher":"GRIN Verlag","publishedDate":"2019-08-20","isbn":"3346001083","pageCount":12,"price":13.99,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=K0aqDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=K0aqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]