[{"bookId":"tL4AEAAAQBAJ","title":"Fair and Unfair Trials in the British Isles, 1800-1940","category":"History","description":"Adopting a microhistory approach, Fair and Unfair Trials in the British Isles, 1800-1940 provides an in-depth examination of the evolution of the modern justice system. Drawing upon criminal cases and trials from England, Scotland, and Ireland, the book examines the errors, procedural systems, and the ways in which adverse influences of social and cultural forces impacted upon individual instances of justice. The book investigates several case studies of both justice and injustice which prompted the development of forensic toxicology, the implementation of state propaganda and an increased interest in press sensationalism. One such case study considers the trial of William Sheen, who was prosecuted and later acquitted of the murder of his infant child at the Old Baily in 1827, an extraordinary miscarriage of justice that prompted outrage amongst the general public. Other case studies include trials for treason, theft, obscenity and blasphemy. Nash and Kilday root each of these cases within their relevant historical, cultural, and political contexts, highlighting changing attitudes to popular culture, public criticism, protest and activism as significant factors in the transformation of the criminal trial and the British judicial system as a whole. Drawing upon a wealth of primary sources, including legal records, newspaper articles and photographs, this book provides a unique insight into the evolution of modern criminal justice in Britain.","shortDescription":"Baxendale: An Understandable Miscarriage of Justice&#39;, Journal of Legal <b>History</b>, 15, pp. 41–72. ... Harling, P. (2001) &#39;The Law of Libel and the Limits of Repression, 1790–1832&#39;, <b>Historical</b> Journal, 44, 1, pp. 107–34.","authors":["David Nash","Anne-Marie Kilday"],"publisher":"Bloomsbury Publishing","publishedDate":"2020-11-12","isbn":"1350050962","pageCount":256,"price":24.09,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=tL4AEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=tL4AEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"6enWAQAAQBAJ","title":"Studies in the History of the Near East","category":"History","description":"First Published in 1973. Routledge is an imprint of Taylor & Francis, an informa company.","shortDescription":"THE TREATMENT OF ARAB <b>HISTORY</b> BY PRIDEAUX, OCKLEY AND SALE UNTIL the last years of the seventeenth century, writings upon the <b>history</b> of the Arabs had been, in England as in Europe generally, academic in their purpose and nature.","authors":["P.M. Holt"],"publisher":"Routledge","publishedDate":"2013-10-28","isbn":"1136273387","pageCount":276,"price":30.58,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=6enWAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=6enWAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"iSX-AgAAQBAJ","title":"Honour, Violence and Emotions in History","category":"History","description":"Honour, Violence and Emotions in History is the first book to draw on emerging cross-disciplinary scholarship on the study of emotions to analyse the history of honour and violence across a broad range of cultures and regions. Written by leading cultural and social historians from around the world, the book considers how emotions - particularly shame, anger, disgust, jealousy, despair and fear - have been provoked and expressed through culturally-embedded and historically specific understandings of honour. The collection explores a range of contexts, from 17th-century China to 18th-century South Africa and 20th-century Europe, offering a broad and wide-ranging analysis of the interrelationships between honour, violence and emotions in history. This ground-breaking book will be of interest to all researchers studying the relationship between violence and the emotions.","shortDescription":"The second problem concerns the Western-centric orientation of the historiography in which studies of duelling in the European and North America past have come to stand for the <b>history</b> of honour-related violence.","authors":["Carolyn Strange","Robert Cribb","Christopher E. Forth"],"publisher":"A&C Black","publishedDate":"2014-04-10","isbn":"1472519485","pageCount":208,"price":20.52,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=iSX-AgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=iSX-AgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]