[{"bookId":"5LbtCwAAQBAJ","title":"Foreign Language Education in America","category":"Language Arts & Disciplines","description":"Foreign language teaching in America today falls into three distinct fields of influence and interest: public and private schools, college and other post-secondary programs, and courses for adult learners. At a time when academics and instructors in each of these fields seek to answer similar questions, too few published resources recognize and address the parallels among them. In response, Foreign Language Education in America is an edited book with contributions that represent the diversity in foreign language education today, including perspectives from elementary, middle schools, high schools, university-level courses, summer programs, federal government, and international learning. This is a practical guide to the state of the field that fills a much-needed gap for scholars, researchers, administrators, and practitioners who are looking for a resource that describes effective practices across the field.","shortDescription":"Alexandria, VA: American Council on the Teaching of <b>Foreign Languages</b>. American Council on the Teaching of <b>Foreign Languages</b> (ACTFL). (2012a). Position statement on early language learning. Available online: www.actfl.org/&nbsp;...","authors":["Steven Berbeco"],"publisher":"Springer","publishedDate":"2016-04-08","isbn":"1137528508","pageCount":256,"price":44.51,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=5LbtCwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=5LbtCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"3VEih5dNH7sC","title":"The attrition of French as a foreign language","category":"Language Arts & Disciplines","description":"Language acquisition is a human endeavor par excellence. As children, all human beings learn to understand and speak at least one language: their mother tongue. It is a process that seems to take place without any obvious effort. Second language learning, particularly among adults, causes more difficulty. The purpose of this series is to compile a collection of high-quality monographs on language acquisition. The series serves the needs of everyone who wants to know more about the problem of language acquisition in general and/or about language acquisition in specific contexts.","shortDescription":"<b>Foreign</b>-<b>language</b> attrition, i.e. the deterioration of <b>foreign</b>-<b>language</b> skills, is a phenomenon that has only recently attracted some serious attention. Apart from some isolated efforts (Kennedy 1932; McMahon 1946; Geoghehan 1950;&nbsp;...","authors":["Hubertus H. Weltens"],"publisher":"Walter de Gruyter","publishedDate":"1989-01-01","isbn":"3111395936","pageCount":143,"price":116.55,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=3VEih5dNH7sC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=3VEih5dNH7sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"qJe1CgAAQBAJ","title":"Culture and Foreign Language Education","category":"Language Arts & Disciplines","description":"The teaching of culture and interculturality is today viewed as an integral part of foreign language education. This book presents insights from recent research on the role of culture in second/foreign and heritage language education. It contains 14 chapters including an introductory chapter that discusses diachronically the evolving notion of culture and how the sociocultural view of culture as a complex and dynamic concept informs language teaching and language learning research. The chapters following the introduction are organised in four parts focusing on: 1) the teacher's role in integrated language and culture learning; 2) the interrelationship between culture, identity, and language learning and use; 3) the effect of culture on learner characteristics which impact language learning processes and outcomes; and 4) curriculum development aimed at fostering language and culture learning. The chapters in Parts 1 to 3 present contributions from current research - either in the form of the authors' original studies or comprehensive reviews of relevant essential research - which bears important implications for curricular practice in foreign language and language teacher education. This close link between research, theory and practice is also maintained in the two chapters in Part 4, which present developmental projects based on well-grounded theoretical frameworks.","shortDescription":"The teaching of culture and interculturality is today viewed as an integral part of foreign language education. This book presents insights from recent research on the role of culture in second/foreign and heritage language education.","authors":["Wai Meng Chan","Sunil Kumar Bhatt","Masanori Nagami","Izumi Walker"],"publisher":"Walter de Gruyter GmbH & Co KG","publishedDate":"2015-07-31","isbn":"1501502956","pageCount":387,"price":90.05,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=qJe1CgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=qJe1CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"YesdAAAAQBAJ","title":"Media, Telecommunications, and Business Strategy","category":"Language Arts & Disciplines","description":"With today’s dynamic and rapidly evolving environment, media managers must have a clear understanding of different delivery platforms, as well as a grasp of critical management, planning, and economic factors in order to stay current and move their organizations forward. Developed for students in telecommunications management, media management, and the business of media, this text helps future media professionals understand the relationship and convergence patterns between the broadcast, cable television, telephony, and Internet communication industries. The second edition includes updated research throughout , including material on major business and technology changes and the importance of digital lifestyle reflected in e-commerce and personalized media selection, such as Netflix and iTunes, and the growing importance of Facebook and social networking from a business perspective.","shortDescription":"Horizontal integration is a growth strategy that allows a <b>business</b> to spread its influence by expanding into different geographic markets while maintaining a commitment to its primary <b>business</b>. The classic example is McDonald&#39;s,&nbsp;...","authors":["Richard A. Gershon"],"publisher":"Routledge","publishedDate":"2013-07-18","isbn":"1136288910","pageCount":456,"price":61.11,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=YesdAAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=YesdAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]