[{"bookId":"Bl7vBQAAQBAJ","title":"Interpol's Forensic Science Review","category":"Law","description":"Every three years, worldwide forensics experts gather at the Interpol Forensic Science Symposium to exchange ideas and discuss scientific advances in the field of forensic science and criminal justice. Drawn from contributions made at the latest gathering in Lyon, France, Interpol's Forensic Science Review is a one-source reference providing a comp","shortDescription":"<b>Science</b> and Technology of Advanced Materials, 2007. 8: p. 19-24. 369. Moore, M.N., Do Nanoparticles Present Ecotoxicological Risks for the Health of the Aquatic Environment? Environment International, 2006. 32: p. 967-976. 370.","authors":["Niamh Nic Daeid","Max Houck"],"publisher":"CRC Press","publishedDate":"2017-08-09","isbn":"1439826595","pageCount":798,"price":124.72,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=Bl7vBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=Bl7vBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"OcQhBQAAQBAJ","title":"Key Aspects of German Business Law","category":"Law","description":"A clear and precise overview of the key aspects of German business law. Written by attorneys involved in the daily practice of business law in Germany, this book is aimed at people who wish to familiarise themselves quickly with the German legal system and the manner in which it influences business purchases, establishment, operations and liquidations. Throughout, special attention has been paid to highlighting and explaining the differences between the German legal system and that of the United States, although the intention is to provide information that will prove valuable to all foreigners, particularly business people and lawyers advising clients with an interest in doing business in Germany.","shortDescription":"Written by attorneys involved in the daily practice of business law in Germany, this book is aimed at people who wish to familiarise themselves quickly with the German legal system and the manner in which it influences business purchases, ...","authors":["Michael Wendler","Bernd Tremml","Bernard Buecker"],"publisher":"Springer Science & Business Media","publishedDate":"2013-04-17","isbn":"3662080656","pageCount":267,"price":59.35,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=OcQhBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=OcQhBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"2W1IEAAAQBAJ","title":"Business Law and Practice 2020/2021","category":"Law","description":"Business Law and Practice provides a detailed guide to the forms of business most commonly encountered in practice, examining how they must be run in accordance with the statutory and common law applicable to them. It explains these businesses relationships with outsiders and gives an overview of their possible tax liabilities. As such, the book provides a comprehensive and practical introduction to advising businesses, whatever their type. The book reflects the law in force as at 1 March 2020 (insolvency and taxation at 1 May 2020). Recent case law and legislative changes are covered. Recent practical examples and statistics are also provided.","shortDescription":"As such, the book provides a comprehensive and practical introduction to advising businesses, whatever their type. The book reflects the law in force as at 1 March 2020 (insolvency and taxation at 1 May 2020).","authors":["Mavrikakis"],"publisher":"College of Law Publishing ","publishedDate":"2020-06-30","isbn":"1913226662","pageCount":968,"price":41.76,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=2W1IEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=2W1IEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"BqtGCgAAQBAJ","title":"Commonwealth Caribbean Business Law","category":"Law","description":"Now in its third edition, Commonwealth Caribbean Business Law continues to break away from the traditional English approach of treating business law primarily as the law of contract and agency. Taking a panoramic view, it explores the foundation of various legal systems before examining areas of legal liability that affect business activities. These include areas such as contract law, tort law, criminal law, agency and internet law which present significant challenges confronting the business sector. The book primarily targets the development of business law principles in several Caribbean Commonwealth jurisdictions but, where appropriate, also embraces the jurisprudence of other Commonwealth nations, such as the United Kingdom, Canada and Australia. It also explores the United States as a non-Commonwealth jurisdiction, given the increasing importance in the Caribbean of judicial pronouncements relating to internet law from this territory. Using excerpts from key judgments, the book allows students, particularly those with a non-legal background, to understand key legal principles for business as presented by the judiciary and draws parallels between legal theory and business practice.","shortDescription":"The book primarily targets the development of business law principles in several Caribbean Commonwealth jurisdictions but, where appropriate, also embraces the jurisprudence of other Commonwealth nations, such as the United Kingdom, Canada ...","authors":["Natalie Persadie","Rajendra Ramlogan"],"publisher":"Routledge","publishedDate":"2015-07-30","isbn":"1317688783","pageCount":476,"price":61.11,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=BqtGCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=BqtGCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]