[
  {
    "bookId": "z_O-BS8b4ucC",
    "title": "Transforming Public Health Practice",
    "category": "Medical",
    "description": "This text provides students a foundation in public healthpractice and management, focusing on developing the knowledge andskills required by the real world of public health. The authors ofTransforming Public Health Practice explain the drivers of changein public health practice, key success factors for public healthprograms, dealing with the chronic disease burden, the impact ofnational health policy on public health practice, and tools forunderstanding and managing population health. Transforming Public Health Practice covers core leadership andmanagement skills, covering areas such as politics, workforce,partnership and collaboration, change management, outcomesorientation, opportunities for improvement, health equity, andfuture challenges. Case studies highlight innovations in healtheducation, working with people with disabilities, partnerships inresponse to disease outbreaks, and health programs. Learningobjectives, chapter summaries, key terms, and discussion questionsenhance each chapter. A downloadable instructors' supplement isavailable on the companion Web site for the book.",
    "shortDescription": "This text provides students a foundation in public health practice and management, focusing on developing the knowledge and skills required by the real world of public health.",
    "authors": ["Bernard J. Healey", "Cheryll D. Lesneski"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2011-08-24",
    "isbn": "1118089936",
    "pageCount": 416,
    "price": 72.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=z_O-BS8b4ucC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=z_O-BS8b4ucC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "pzdHCgAAQBAJ",
    "title": "Empowering Women and Strengthening Health Systems and Services Through Investing in Nursing and Midwifery Enterprise",
    "category": "Medical",
    "description": "In September 2014, the Global Forum on Innovation in Health Professional Education and the Forum on Public-Private Partnerships for Global Health and Safety of the Institute of Medicine convened a workshop on empowering women and strengthening health systems and services through investing in nursing and midwifery enterprise. Experts in women's empowerment, development, health systems' capacity building, social enterprise and finance, and nursing and midwifery explored the intersections between and among these domains. Innovative and promising models for more sustainable health care delivery that embed women's empowerment in their missions were examined. Participants also discussed uptake and scale; adaptation, translation, and replication; financing; and collaboration and partnership. Empowering Women and Strengthening Health Systems and Services Through Investing in Nursing and Midwifery Enterprise summarizes the presentations and discussion of the workshop. This report highlights examples and explores broad frameworks for existing and potential intersections of different sectors that could lead to better health and well-being of women around the world, and how lessons learned from these examples might be applied in the United States.",
    "shortDescription": "Empowering Women and Strengthening Health Systems and Services Through Investing in Nursing and Midwifery Enterprise summarizes the presentations and discussion of the workshop.",
    "authors": [
      "Institute of Medicine",
      "Board on Global Health",
      "Forum on Public-Private Partnerships for Global Health and Safety",
      "Global Forum on Innovation in Health Professional Education"
    ],
    "publisher": "National Academies Press",
    "publishedDate": "2015-06-23",
    "isbn": "0309316758",
    "pageCount": 140,
    "price": 39.71,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=pzdHCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=pzdHCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "sYxFIcDcrboC",
    "title": "Transforming Health Markets in Asia and Africa",
    "category": "Medical",
    "description": "There has been a dramatic spread of health markets in much of Asia and Africa over the past couple of decades. This has substantially increased the availability of health-related goods and services in all but the most remote localities, but it has created problems with safety, efficiency and cost. The effort to bring order to these chaotic markets is almost certain to become one of the greatest challenges in global health. This book documents the problems associated with unregulated health markets and presents innovative approaches that have emerged to address them. It outlines a framework that researchers, policy makers and social entrepreneurs can use to analyse health market systems and assess the likely outcome of alternative interventions. The book presents a new way of understanding highly marketised health systems, applies this understanding to an analysis of health markets in countries across Asia and Africa and identifies some of the major new developments for making these markets perform better in meeting the needs of the poor. It argues that it is time to move beyond ideological debates about the roles of public and private sectors in an ideal health system and focus more on understanding the operation of these markets and developing practical strategies for improving their performance. This book is ideal reading for researchers and students in public health, development studies, public policy and administration, health economics, medical anthropology, and science and technology studies. It is also a valuable resource for policy makers, social entrepreneurs, and planners and managers in public and private sector health systems, including pharmaceutical companies, aid agencies, NGOs and international organisations.",
    "shortDescription": "This book documents the problems associated with unregulated health markets and presents innovative approaches that have emerged to address them.",
    "authors": ["Gerald Bloom", "Barun Kanjilal", "Henry Lucas", "David H. Peters"],
    "publisher": "Routledge",
    "publishedDate": "2012-12-13",
    "isbn": "1136238239",
    "pageCount": 198,
    "price": 27.19,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=sYxFIcDcrboC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=sYxFIcDcrboC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "MOvSCgAAQBAJ",
    "title": "Health Promotion in Communities",
    "category": "Medical",
    "description": "In her latest book, Dr. Clark applies a holistic, wellness perspective to community health, focusing on community strengths and resilience - such as positive nutrition, healthy environment, fitness, and self care skills - rather than risks and disease. Practitioners and students will find this book a practical and comprehensive resource for creating community health programs and promoting wellness among individuals and groups. Special features include: A step-by-step guide to planning, implementing, and marketing community health programs; Strategies for wellness nutrition, fitness, stress management, and smoking cessation; Strategies for preventing violence in the schools and larger community; Tips on sharpening communication skills with individuals and groups; and Models of culturally sensitive health promotion programs.",
    "shortDescription": "Practitioners and students will find this book a practical and comprehensive resource for creating community health programs and promoting wellness among individuals and groups.",
    "authors": ["Carolyn Chambers Clark, EdD, ARNP,FAAN"],
    "publisher": "Springer Publishing Company",
    "publishedDate": "2001-12-27",
    "isbn": "0826116191",
    "pageCount": 496,
    "price": 96.23,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=MOvSCgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=MOvSCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "6uPX9XeS9g4C",
    "title": "The Elgar Companion to Health Economics",
    "category": "Medical",
    "description": "ÔThe Elgar Companion to Health Economics is a comprehensive and accessible look at the field, as seen by its leading figures.Õ Ð Joseph Newhouse, Harvard Medical School, US Acclaim for the first edition: ÔThis Companion is a timely addition. . . It contains 50 chapters, from 90 contributors around the world, on the topical and policy-relevant aspects of health economics. . . there is a balanced coverage of theoretical and empirical materials, and conceptual and practical issues. . . I have found the Companion very useful.Õ Ð Sukhan Jackson, Economic Analysis and Policy ÔThis encyclopedic work provides interested readers with an authoritative and comprehensive overview of many, if not all, of the current research issues in health economics. Highly recommended. Upper-level undergraduates and above.Õ Ð R.M. Mullner, Choice This comprehensive collection brings together more than 50 contributions from some of the most influential researchers in health economics. It authoritatively covers theoretical and empirical issues in health economics, with a balanced range of material on equity and efficiency in health care systems, health technology assessment and issues of concern for developing countries. This thoroughly revised second edition is expanded to include four new chapters, while all existing chapters have been extensively updated. The Elgar Companion to Health Economics, Second Edition intends to take an audience of advanced undergraduates, postgraduates and researchers to the current frontier of research by providing concise and readable introductions to key topics.",
    "shortDescription": "Highly recommended. Upper-level undergraduates and above.Õ Ð R.M. Mullner, Choice This comprehensive collection brings together more than 50 contributions from some of the most influential researchers in health economics.",
    "authors": ["Andrew M. Jones"],
    "publisher": "Edward Elgar Publishing",
    "publishedDate": "2012",
    "isbn": "0857938134",
    "pageCount": 550,
    "price": 34.43,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=6uPX9XeS9g4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=6uPX9XeS9g4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "JivwDwAAQBAJ",
    "title": "Introduction to Community and Public Health",
    "category": "Medical",
    "description": "Learn the basics of the five core areas of community and public health Introduction to Community and Public Health, 2nd Edition covers the basics in each area of community and public health as identified by the Association of Schools of Public Health. With a student-friendly approach, the authors discuss epidemiology, biostatistics, social and behavioral sciences, environmental health, and healthy policy and management. The book is written to serve both graduate and undergraduate public health students, as well as to help prepare for the Certified in Public Health (CPH) exam, Certified Health Education Specialist (CHES) exam and Master certified in Health Education Specialist (MCHES) exam, the book covers each of these five core disciplines, plus other important topics.",
    "shortDescription": "In addition, this new edition provides expanded coverage of infectious disease epidemiology, chronic disease epidemiology, and newer theories.",
    "authors": ["Manoj Sharma", "Paul W. Branscum"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2020-07-07",
    "isbn": "1119633710",
    "pageCount": 464,
    "price": 69.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=JivwDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=JivwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
