[{"bookId":"b16pAgAAQBAJ","title":"Artificial Intelligence: The Basics","category":"Philosophy","description":"'if AI is outside your field, or you know something of the subject and would like to know more then Artificial Intelligence: The Basics is a brilliant primer.' - Nick Smith, Engineering and Technology Magazine November 2011 Artificial Intelligence: The Basics is a concise and cutting-edge introduction to the fast moving world of AI. The author Kevin Warwick, a pioneer in the field, examines issues of what it means to be man or machine and looks at advances in robotics which have blurred the boundaries. Topics covered include: how intelligence can be defined whether machines can 'think' sensory input in machine systems the nature of consciousness the controversial culturing of human neurons. Exploring issues at the heart of the subject, this book is suitable for anyone interested in AI, and provides an illuminating and accessible introduction to this fascinating subject.","shortDescription":"Exploring issues at the heart of the subject, this book is suitable for anyone interested in AI, and provides an illuminating and accessible introduction to this fascinating subject.","authors":["Kevin Warwick"],"publisher":"Routledge","publishedDate":"2013-03-01","isbn":"1136629831","pageCount":192,"price":14.09,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=b16pAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=b16pAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"YfonAAAAQBAJ","title":"Deleuze and Art","category":"Philosophy","description":"In Deleuze and Art Anne Sauvagnargues, one of the world's most renowned Deleuze scholars, offers a unique insight into the constitutive role played by art in the formation of Deleuze's thought. By reproducing Deleuze's social and intellectual references, Sauvagnargues is able to construct a precise map of the totality of Deleuze's work, pinpointing where key Deleuzian concepts first emerge and eventually disappear. This innovative methodology, which Sauvagnargues calls \"periodization\", provides a systematic historiography of Deleuze's philosophy that remains faithful to his affirmation of the principle of exteriority. By analyzing the external relations between Deleuze's self-proclaimed three philosophical periods, Sauvagnargues gives the reader an inside look into the conceptual and artistic landscape that surrounded Deleuze and the creation of his philosophy. With extreme clarity and precision, Sauvagnargues provides an important glimpse into Deleuze's philosophy by reconstructing the social and intellectual contexts that contributed to the trajectory of his thought. This book is the product of insightful and careful research, which has not been made available to English readers of Deleuze before now.","shortDescription":"Semiotics must not depend on either the imaginary resource of metaphorical resemblance, nor on the detection of intelligible formal structures; these are two processes of interpretation that unburden <b>art</b> from its efficacy and confine it&nbsp;...","authors":["Anne Sauvagnargues"],"publisher":"A&amp;C Black","publishedDate":"2013-08-15","isbn":"0826435637","pageCount":224,"price":20.52,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=YfonAAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=YfonAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]