[{"bookId":"qFI8DwAAQBAJ","title":"Artificial Intelligence","category":"Psychology","description":"First published in 1987, this book provides a stimulating introduction to artificial intelligence (AI) - the science of thinking machines. After a general introduction to AI, including its history, tools, research methods, and its relation to psychology, Garnham gives an account of AI research in five major areas: knowledge representation, vision, thinking and reasoning, language, and learning. He then describes the more important applications of AI and discusses the broader philosophical issues raised by the possibility of thinking machines. In the final chapter, he speculates about future research in AI, and more generally in cognitive science. Suitable for psychology students, the book also provides useful background reading for courses on vision, thinking and reasoning, language and learning.","shortDescription":"First published in 1987, this book provides a stimulating introduction to artificial intelligence (AI) - the science of thinking machines.","authors":["Alan Garnham"],"publisher":"Routledge","publishedDate":"2017-11-01","isbn":"1351337866","pageCount":296,"price":22.95,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=qFI8DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=qFI8DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}},{"bookId":"aRaGDwAAQBAJ","title":"Mental Health and Well-being Interventions in Sport","category":"Psychology","description":"Mental health within elite sport has traditionally been ignored, but recent research has shown that competitive sport can at times seriously undermine mental health and that athletes are exposed to specific stressors that hinder their mental health optimisation. Mental Health and Well-being Interventions in Sport provides an indispensable guide for researchers and practitioners wanting to understand and implement sport-based intervention processes. This important book adopts an evidenced based approach, discussing the context of the intervention, its design and implementation, and its evaluation and legacy. With cases on depression, eating disorders, and athletic burnout, the book is designed to provide practitioners, policy makers and researchers with a cutting-edge overview of the key issues involved in this burgeoning area, while also including cases on how sport itself has been used as a method to improve mental health. Written for newcomers and established practitioners alike, the text is an essential read for researchers and practitioners in better understanding the sport setting-based intervention processes through presenting current research, theory and practice, applicable in a variety of sports settings and contexts.","shortDescription":"This important book adopts an evidenced based approach, discussing the context of the intervention, its design and implementation, and its evaluation and legacy.","authors":["Gavin Breslin","Gerard Leavey"],"publisher":"Routledge","publishedDate":"2019-01-14","isbn":"1351375709","pageCount":154,"price":28.89,"imageLinks":{"smallThumbnail":"http://books.google.com/books/content?id=aRaGDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api","thumbnail":"http://books.google.com/books/content?id=aRaGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"}}]