[
  {
    "bookId": "zZbhDwAAQBAJ",
    "title": "Data Science Applied to Sustainability Analysis",
    "category": "Science",
    "description": "Data Science Applied to Sustainability Analysis focuses on the methodological considerations associated with applying this tool in analysis techniques such as lifecycle assessment and materials flow analysis. As sustainability analysts need examples of applications of big data techniques that are defensible and practical in sustainability analyses and that yield actionable results that can inform policy development, corporate supply chain management strategy, or non-governmental organization positions, this book helps answer underlying questions. In addition, it addresses the need of data science experts looking for routes to apply their skills and knowledge to domain areas. Presents data sources that are available for application in sustainability analyses, such as market information, environmental monitoring data, social media data and satellite imagery Includes considerations sustainability analysts must evaluate when applying big data Features case studies illustrating the application of data science in sustainability analyses",
    "shortDescription": "Categories of <b>data science</b> for materials discovery We interpret the term, <b>data science</b>, to encompass not only the analysis of data with machine learning, but the full pipeline of materials-by-design.",
    "authors": ["Jennifer Dunn", "Prasanna Balaprakash"],
    "publisher": "Elsevier",
    "publishedDate": "2021-05-11",
    "isbn": "0128179775",
    "pageCount": 310,
    "price": 91.7,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=zZbhDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=zZbhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "TPw4DgAAQBAJ",
    "title": "The Calculus Wars",
    "category": "Science",
    "description": "Now regarded as the bane of many college students' existence, calculus was one of the most important mathematical innovations of the seventeenth century. But a dispute over its discovery sewed the seeds of discontent between two of the greatest scientific giants of all time -- Sir Isaac Newton and Gottfried Wilhelm Leibniz. Today Newton and Leibniz are generally considered the twin independent inventors of calculus, and they are both credited with giving mathematics its greatest push forward since the time of the Greeks. Had they known each other under different circumstances, they might have been friends. But in their own lifetimes, the joint glory of calculus was not enough for either and each declared war against the other, openly and in secret. This long and bitter dispute has been swept under the carpet by historians -- perhaps because it reveals Newton and Leibniz in their worst light -- but The Calculus Wars tells the full story in narrative form for the first time. This vibrant and gripping scientific potboiler ultimately exposes how these twin mathematical giants were brilliant, proud, at times mad and, in the end, completely human.",
    "shortDescription": "This long and bitter dispute has been swept under the carpet by historians -- perhaps because it reveals Newton and Leibniz in their worst light -- but The Calculus Wars tells the full story in narrative form for the first time.",
    "authors": ["Jason Socrates Bardi"],
    "publisher": "Hachette UK",
    "publishedDate": "2009-04-29",
    "isbn": "0786733640",
    "pageCount": 304,
    "price": 9.49,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=TPw4DgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=TPw4DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "0S48DQAAQBAJ",
    "title": "Principles of Physics",
    "category": "Science",
    "description": "This book starts from a set of common basic principles to establish the formalisms in all areas of fundamental physics, including quantum field theory, quantum mechanics, statistical mechanics, thermodynamics, general relativity, electromagnetic field, and classical mechanics. Instead of the traditional pedagogic way, the author arranges the subjects and formalisms in a logical-sequential way, i.e. all the formulas are derived from the formulas before them. The formalisms are also kept self-contained. Most of the required mathematical tools are also given in the appendices. Although this book covers all the disciplines of fundamental physics, the book is concise and can be treated as an integrated entity. This is consistent with the aphorism that simplicity is beauty, unification is beauty, and thus physics is beauty. The book may be used as an advanced textbook by graduate students. It is also suitable for physicists who wish to have an overview of fundamental physics.",
    "shortDescription": "It is my belief that all <b>physics</b> laws should be understandable. In this book, I endeavor to establish the physical formalisms based on basic principles that are as simple and understandable as possible.",
    "authors": ["Jun Ni"],
    "publisher": "World Scientific Publishing Company",
    "publishedDate": "2013-12-24",
    "isbn": "9814579416",
    "pageCount": 444,
    "price": 22.09,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=0S48DQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=0S48DQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "x-zxCAAAQBAJ",
    "title": "Part I: Physical Chemistry. Part II: Solid State Physics",
    "category": "Science",
    "description": "The fourth volume of the Collected Works is devoted to Wigners contribution to physical chemistry, statistical mechanics and solid-state physics. One corner stone was his introduction of what is now called the Wigner function, while his paper on adiabatic perturbations foreshadowed later work on Berry phases. Although few in number, Wigners articles on solid-state physics laid the foundations for the modern theory of the electronic structure of metals.",
    "shortDescription": "Annotation by Nandor Balazs I. Studies in Chemical Reactions Though young Eugene Wigner&#39;s original interests did lie in the direction of <b>physics</b>, he nevertheless started his university studies reading chemical engineering.",
    "authors": ["Arthur S. Wightman"],
    "publisher": "Springer",
    "publishedDate": "2013-12-11",
    "isbn": "3642590330",
    "pageCount": 456,
    "price": 48.22,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=x-zxCAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=x-zxCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "EUvOviwwc2cC",
    "title": "Key Concepts in Geography",
    "category": "Science",
    "description": "\"This book clearly outlines key concepts that all geographers should readily be able to explain. It does so in a highly accessible way. It is likely to be a text that my students will return to throughout their degree.\" - Dr Karen Parkhill, Bangor University \"The editors have done a fantastic job. This second edition is really accessible to the student and provides the key literature in the key geographical terms of scale, space, time, place and landscape.\" - Dr Elias Symeonakis, Manchester Metropolitan University \"An excellent introductory text for accessible overviews of key concepts across human and physical geography.\" - Professor Patrick Devine-Wright, Exeter University Including ten new chapters on nature, globalization, development and risk, and a new section on practicing geography, this is a completely revised and updated edition of the best-selling, standard student resource. Key Concepts in Geography explains the key terms - space, time, place, scale, landscape - that define the language of geography. It is unique in the reference literature as it provides in one volume concepts from both human geography and physical geography. Four introductory chapters on different intellectual traditions in geography situate and introduce the entries on the key concepts. Each entry then comprises a short definition, a summary of the principal arguments, a substantive 5,000-word discussion, the use of real-life examples, and annotated notes for further reading. Written in an accessible way by established figures in the discipline, the definitions provide thorough explanations of all the core concepts that undergraduates of geography must understand to complete their degree.",
    "shortDescription": "&quot;This book clearly outlines key concepts that all geographers should readily be able to explain. It does so in a highly accessible way. It is likely to be a text that my students will return to throughout their degree.",
    "authors": ["Nicholas Clifford", "Sarah Holloway", "Stephen P Rice", "Gill Valentine"],
    "publisher": "SAGE Publications Ltd",
    "publishedDate": "2008-12-12",
    "isbn": "9781446243466",
    "pageCount": 480,
    "price": 51.52,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=EUvOviwwc2cC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=EUvOviwwc2cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "bZzdAAAAQBAJ",
    "title": "Geography of Climate Change",
    "category": "Science",
    "description": "Climate change is one of the inescapable themes of current times. Climate change confronts society in issues as diverse as domestic and international political debate and negotiation, discussion in the media and public opinion, land management choices and decisions, and concerns about environmental, social and economic priorities now and for the future. Climate change also spans spatial, temporal and organisational scales, and has strong links with nature-society relationships, environmental dynamics, and vulnerability. Understanding the full range of possible consequences of climate change is essential for informed decision making and debate. This book provides a collection of chapters that span environmental, social and economic aspects of climate change. Together the chapters provide a diverse and contrasting series that highlights the need to analyze, review and debate climate change and its possible impacts and consequences from multiple perspectives. The book also is intended to promote discussion and debate of a more integrated, inclusive and open approach to climate change and demonstrates the value of geography in addressing climate change issues. This book was originally published as a special issue of Annals of the Association of American Geographers.",
    "shortDescription": "In Scale and <b>geographic</b> inquiry: Nature, society and method, ed. E. Sheppard and R. McMaster, 236–55. Oxford, UK: Bla  well. Litz, F. T. 2008. Toward a constructive dialogue on federal and state Roles in climate ange policy.",
    "authors": ["Richard John Aspinall"],
    "publisher": "Routledge",
    "publishedDate": "2013-09-13",
    "isbn": "1135756759",
    "pageCount": 336,
    "price": 24.65,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=bZzdAAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=bZzdAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "u0UsBwAAQBAJ",
    "title": "Greek Science in the Long Run",
    "category": "Science",
    "description": "Greek traditions relating to both the arts and sciences of life and health and those regarding the systematic development of theories of measurement and quantification enjoyed an incredibly long reputation and showed a kind of versatility that challenges any simplistic, dogmatic or a priori viewpoint about the meaning and social function of systematic knowledge. In this sense, they allow us to focus on very specific traits of the multiple processes of production, textual arrangement and transmission of the sciences. Greek Science in the Long Run: Essays on the Greek Scientific Tradition (4th c. BCE–17th c. CE) offers a collection of essays in which renowned international experts in ancient, medieval and early modern history and culture and the history of science, together with young researchers in these same fields, reflect upon different aspects of this long-standing prominence of Greek models and traditions in the changing configuration of the sciences. The main aim of the volume is to revisit the different processes by which such doctrinal traditions originated, were transmitted and received within diverse socio-cultural contexts and frameworks. The specialized scholars and academics contributing to the volume embrace advanced standpoints regarding these issues and ensure a successful and substantial contribution to one of the lines of research that has recently attracted the most attention within the field of humanities: the interdisciplinary project of a historical epistemology seriously informed by an advanced history of epistemology or the sciences.",
    "shortDescription": "<b>Science</b> and the <b>Sciences</b> in Plato, New York: Eidos. Burnyeat, M.F. (2000). “Plato on Why Mathematics is Good for the Soul”. In T. Smiley (ed.) Mathematics and Necessity, (pp. 1-81), Proceedings of the British Academy 103: Oxford&nbsp;...",
    "authors": ["Paula Olmos"],
    "publisher": "Cambridge Scholars Publishing",
    "publishedDate": "2012-03-15",
    "isbn": "1443838411",
    "pageCount": 335,
    "price": 66.41,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=u0UsBwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=u0UsBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "8TOpAgAAQBAJ",
    "title": "Reactive Intermediates in Organic Chemistry",
    "category": "Science",
    "description": "Most reactions in organic chemistry do not proceed in a single step but rather take several steps to yield the desired product. In the course of these multi-step reaction sequences, short-lived intermediates can be generated that quickly convert into other intermediates, reactants, products or side products. As these intermediates are highly reactive, they cannot usually be isolated, but their existence and structure can be proved by theoretical and experimental methods. Using the information obtained, researchers can better understand the underlying reaction mechanism of a certain organic transformation and thus develop novel strategies for efficient organic synthesis. The chapters are clearly structured and are arranged according to the type of intermediate, providing information on the formation, characterization, stereochemistry, stability, and reactivity of the intermediates. Additionally, representative examples and a problem section with different levels of difficulty are included for self-testing the newly acquired knowledge. By providing a deeper understanding of the underlying concepts, this is a musthave reference for PhD and Master Students in organic chemistry, as well as a valuable source of information for chemists in academia and industry working in the field. It is also ideal as primary or supplementary reading for courses on organic chemistry, physical organic chemistry or analytical chemistry.",
    "shortDescription": "<b>Chemistry</b> is an old science that influences every aspect of life on earth (from toothpaste to life-saving medicines) because just about everything that we can touch and feel is made of chemicals, which is why it is known as the mother&nbsp;...",
    "authors": ["Maya Shankar Singh"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2014-01-22",
    "isbn": "3527678271",
    "pageCount": 296,
    "price": 60.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=8TOpAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=8TOpAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "srv8BAAAQBAJ",
    "title": "Studies in Natural Products Chemistry",
    "category": "Science",
    "description": "Studies in Natural Products Chemistry, Volume 10: Stereoselective Synthesis (Part F) is a collection of articles about studies on important organic molecules. The book covers studies such as that on the synthesis of cembranes as well as its natural occurrence and bioactivity; the stereoselective synthesis of Vitamin D; the synthesis of isoquinolinequinone antibiotics; and the nucleophilic addition chemistry of polyunsaturated carbonyl compounds. Also covered in the book are subjects such as developments in the synthesis of medium ring ethers; the biological properties, chemistry, and synthesis of didemnins; and natural products synthesis based on novel ring transformation. The text is recommended for organic chemists who would like to know more about the progresses in the study of important organic molecules and their implications in different fields.",
    "shortDescription": "To exert stereocontrol over the carbon nucleophilicity of polyunsaturated enolates would be a powerful compliment to their <b>chemistry</b>. With these, as well as other anticipated (and unanticipated) discoveries in the synthesis and addition&nbsp;...",
    "authors": ["Atta-ur- Rahman"],
    "publisher": "Elsevier",
    "publishedDate": "2013-10-22",
    "isbn": "1483100979",
    "pageCount": 730,
    "price": 49.66,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=srv8BAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=srv8BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "eYuZAwAAQBAJ",
    "title": "Synthetic Methods of Organometallic and Inorganic Chemistry, Volume 7, 1997",
    "category": "Science",
    "description": "Designed as a benchtop tool, the series includes detailed and reliable experimental procedures for the preparation of common but imp ortant starting compounds, organized according to the periodic table. Properties of the compounds and additional references are also provided. In most cases, no strict borderline has been drawn between inorganic and organometallic compounds. Instead, the material is conveniently presented so that for every group of elements, the various aspects of the chemistry are combined. Several hundred in ternational specialists with established expertise in their respective fields have contributed, resulting in proven and reliable pre parations. In view of the enormous growth of organometallic chemistry, Synthetic Methods of Organometallic and Inorganic Chemistry p rovides you with a balanced compilation of carefully selected and representative examples for all classes of compounds. // The conte nt of this e-book was originally published in 1997.",
    "shortDescription": "2), a professor of inorganic <b>chemistry</b> at the University of Freiburg (Germany), merits respect not only for having started the new “Handbuch” in difficult times but also for creating a standard book of <b>chemical</b> recipes which became&nbsp;...",
    "authors": ["Wolfgang A. Herrmann"],
    "publisher": "Georg Thieme Verlag",
    "publishedDate": "2014-05-14",
    "isbn": "3131792310",
    "pageCount": 306,
    "price": 97.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=eYuZAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=eYuZAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "5BTiDQAAQBAJ",
    "title": "Pictured Glossary in Biology",
    "category": "Science",
    "description": "The glossary continues to be a valuable guidance tool for biological students those studying biology either in High Schools or Science Colleges as well as scientific researchers. Everything you need for learning biological terminology is right in your hands. The language of biology is rigorous. It is among the great tools of the mind for a better understanding and more accurate network between all biologists of the life sciences.The lists of prefixes, suffixes and terms arranged alphabetically, which lets students look terms up even if they are not sure about their exact spellings. It provides comprehensive coverage of biology, and biochemistry entries on key scientists.This glossary will contain 8000 scientific words expressing all biology branches (Zoology, Botany & Microbiology). The number of the glossary in this book is more than that found in Oxford Dictionary.",
    "shortDescription": "The number of the glossary in this book is more than that found in Oxford Dictionary.",
    "authors": ["Prof. Amal Attia El-Morsy Ibrahim"],
    "publisher": "Scientific Research Publishing, Inc. USA",
    "publishedDate": "2017-01-01",
    "isbn": "1618963686",
    "pageCount": 3204,
    "price": 59.98,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=5BTiDQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=5BTiDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "hVr2BwAAQBAJ",
    "title": "Fractals in Biology and Medicine",
    "category": "Science",
    "description": "\"Fractals in Biology and Medicine\" explores the potential of fractal geometry for describing and understanding biological organisms, their development and growth as well as their structural design and functional properties. It extends these notions to assess changes associated with disease in the hope to contribute to the understanding of pathogenetic processes in medicine. The book is the first comprehensive presentation of the importance of the new concept of fractal geometry for biological and medical sciences. It collates in a logical sequence extended papers based on invited lectures and free communications presented at a symposium in Ascona, Switzerland, attended by leading scientists in this field, among them the originator of fractal geometry, Benoit Mandelbrot. \"Fractals in Biology and Medicine\" begins by asking how the theoretical construct of fractal geometry can be applied to biomedical sciences and then addresses the role of fractals in the design and morphogenesis of biological organisms as well as in molecular and cell biology. The consideration of fractal structure in understanding metabolic functions and pathological changes is a particularly promising avenue for future research.",
    "shortDescription": "The book is the first comprehensive presentation of the importance of the new concept of fractal geometry for biological and medical sciences.",
    "authors": ["Theo F. Nonnenmacher", "Gabriele A. Losa", "Ewald R. Weibel"],
    "publisher": "Birkhäuser",
    "publishedDate": "2013-03-07",
    "isbn": "3034885016",
    "pageCount": 397,
    "price": 27.45,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=hVr2BwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=hVr2BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "r-qpwsvmvF4C",
    "title": "Developmental Biology Protocols",
    "category": "Science",
    "description": "The molecular biology revolution has transformed developmental biology into one of the most exciting and fruitful fields in experimental biomedical research today. In Developmental Biology Protocols, established leaders in this field demonstrate this achievement with a comprehensive collection of cutting-edge protocols for studying and analyzing the events of embryonic development. Drawing on state-of-the-art cellular and molecular techniques, as well as new and sophisticated imaging and information technologies, this 3rd volume and last volume introduces powerful techniques for the manipulation of developmental gene expression and function, the analysis of gene expression, the characterization of tissue morphogenesis and development, the in vitro study of differentiation and development, and the genetic analysis of developmental models of diseases. The 1st and 2nd volumes in this seminal set complete today's widest-ranging collection of techniques designed to decipher the exact cellular, molecular, and genetic mechanisms that control the form, structure, and function of the developing embryo. Volume 1 presents readily reproducible methods for establishing and characterizing several widely used experimental model systems, for both the study of developmental patterns and morphogenesis, and the examination of embryo structure and function. In addition, there are step-by-step methods for the analysis of cell lineage, the production and use of chimeras, and the experimental molecular manipulation of embryos, including the application of viral vectors. No less innovative, volume 2 describes state-of-the-art methods for the study of organogenesis, the analysis of abnormal development and teratology, the screening and mapping of novel genes and mutations, and the application of transgenesis, including the production of transgenic animals and gene knockouts. Highly practical and richly annotated, the three volumes of Developmental Biology Protocols describe multiple experimental systems and details techniques adopted from the broadest array of biomedical disciplines. Every researcher will not only better understand the principles, background, and rationale for how form and function are elaborated in an organism, but also gain full practical access to today's best methods for its analysis.",
    "shortDescription": "In part, this is so because the subject matter deals with the innately fascinating biological events—changes in form, structure, and function of the organism.",
    "authors": ["Rocky S. Tuan", "Cecilia W. Lo"],
    "publisher": "Springer Science & Business Media",
    "publishedDate": "2000",
    "isbn": "1592590667",
    "pageCount": 522,
    "price": 118.71,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=r-qpwsvmvF4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=r-qpwsvmvF4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "5a5bAwAAQBAJ",
    "title": "Colliding Worlds: How Cutting-Edge Science Is Redefining Contemporary Art",
    "category": "Science",
    "description": "A dazzling look at the artists working on the frontiers of science. In recent decades, an exciting new art movement has emerged in which artists utilize and illuminate the latest advances in science. Some of their provocative creations—a live rabbit implanted with the fluorescent gene of a jellyfish, a gigantic glass-and-chrome sculpture of the Big Bang (pictured on the cover)—can be seen in traditional art museums and magazines, while others are being made by leading designers at Pixar, Google’s Creative Lab, and the MIT Media Lab. In Colliding Worlds, Arthur I. Miller takes readers on a wild journey to explore this new frontier. Miller, the author of Einstein, Picasso and other celebrated books on science and creativity, traces the movement from its seeds a century ago—when Einstein’s theory of relativity helped shape the thinking of the Cubists—to its flowering today. Through interviews with innovative thinkers and artists across disciplines, Miller shows with verve and clarity how discoveries in biotechnology, cosmology, quantum physics, and beyond are animating the work of designers like Neri Oxman, musicians like David Toop, and the artists-in-residence at CERN’s Large Hadron Collider. From NanoArt to Big Data, Miller reveals the extraordinary possibilities when art and science collide.",
    "shortDescription": "... 348 <b>art</b>, defining of,303–4, 316,317 <b>Art</b> and Electronic Media (Shanken), xxii <b>Art</b> &amp; Science Collaborations, Inc. (ASCI), 306 <b>Art</b> &amp; Science: Merging Artand Science to Make a Revolutionary New <b>Art</b> Movement,190–204 three debates at,&nbsp;...",
    "authors": ["Arthur I. Miller"],
    "publisher": "W. W. Norton & Company",
    "publishedDate": "2014-06-16",
    "isbn": "0393244253",
    "pageCount": 352,
    "price": 22.26,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=5a5bAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=5a5bAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "0KQbEAAAQBAJ",
    "title": "Recent Applications of Selected Name Reactions in the Total Synthesis of Alkaloids",
    "category": "Science",
    "description": "Recent Applications of Selected Name Reactions in the Total Synthesis of Alkaloids includes comprehensive coverage of name reactions in the synthesis of alkaloids. This book highlights the synthesis of various alkaloids using special name reactions including the Diels-Alder, Friedel-Crafts, Heck, Mannich, Pauson-Khand, Pictet-Spengler, Sonogashira and Suzuki reactions. In this book, some selected name reactions in the total synthesis of alkaloids are covered, as they can be used as the key step/steps in the synthesis of different alkaloids exhibiting various biological activities. All chapters include an introduction, history and mechanism of the name reaction, and present the origin of the natural product and its known biological activities. The pathway to total synthesis is visually illustrated, and the focus is on the step in which a name reaction is applied. Chemists working in the area of synthetic organic chemistry will find this reference useful, as well as those working to develop novel methodologies for the synthesis of natural products in both academia and industry. This book is also beneficial to biologists, pharmacists and botanists. Includes an introduction of alkaloids, their origins and biological properties Features the applications of special name reactions as the key step in the total synthesis of featured alkaloids Covers the pathway for the synthesis of alkaloids from commercially available or easily accessible starting materials by using at least one name reaction to achieve the desired target products",
    "shortDescription": "[6] M.B. Smith, J. March, Advanced Organic Chemistry: <b>Reactions</b>, Mechanisms, and Structure, sixth ed., Wiley-Interscience, New York, 2007. [7] (a) A. Maercker, Org. <b>React</b>. 14 (2004) 270; (b) A. Maercker, Org. <b>React</b>.",
    "authors": ["Majid M. Heravi", "Vahideh Zadsirjan"],
    "publisher": "Elsevier",
    "publishedDate": "2021-06-12",
    "isbn": "0128242582",
    "pageCount": 402,
    "price": 140,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=0KQbEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=0KQbEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "onXhCQAAQBAJ",
    "title": "The Mechanisms of Reactions Influencing Atmospheric Ozone",
    "category": "Science",
    "description": "Ozone, an important trace component, is critical to life on Earth and to atmospheric chemistry. The presence of ozone profoundly impacts the physical structure of the atmosphere and meteorology. Ozone is also an important photolytic source for HO radicals, the driving force for most of the chemistry that occurs in the lower atmosphere, is essential to shielding biota, and is the only molecule in the atmosphere that provides protection from UV radiation in the 250-300 nm region. However, recent concerns regarding environmental issues have inspired a need for a greater understanding of ozone, and the effects that it has on the Earth's atmosphere. The Mechanisms of Reactions Influencing Atmospheric Ozone provides an overview of the chemical processes associated with the formation and loss of ozone in the atmosphere, meeting the need for a greater body of knowledge regarding atmospheric chemistry. Renowned atmospheric researcher Jack Calvert and his coauthors discuss the various chemical and physical properties of the earth's atmosphere, the ways in which ozone is formed and destroyed, and the mechanisms of various ozone chemical reactions in the different spheres of the atmosphere. The volume is rich with valuable knowledge and useful descriptions, and will appeal to environmental scientists and engineers alike. A thorough analysis of the processes related to tropospheric ozone, The Mechanisms of Reactions Influencing Atmospheric Ozone is an essential resource for those hoping to combat the continuing and future environmental problems, particularly issues that require a deeper understanding of atmospheric chemistry.",
    "shortDescription": "One of the photolysis <b>reactions</b> of ozone produces an excited oxygen atom, O(1D), and a small fraction of these <b>react</b> to produce HO, as discussed previously. The production of HO through the photolysis of CH2O is a more complex process.",
    "authors": ["Jack G. Calvert", "John J. Orlando", "William R. Stockwell", "Timothy J. Wallington"],
    "publisher": "Oxford University Press",
    "publishedDate": "2015-05-13",
    "isbn": "0190297573",
    "pageCount": 608,
    "price": 150.3,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=onXhCQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=onXhCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "OJevSztje7IC",
    "title": "Addition and Elimination Reactions of Aliphatic Compounds",
    "category": "Science",
    "description": "Addition and Elimination Reactions of Aliphatic Compounds",
    "shortDescription": "These <b>reactions</b> almost certainly involve carbonium-ion intermediates, as do nearly all other interconversions in the 5-methyl-2-cyclohexenyl system”. The kinetic and stereochemical results, however, lead to the surprising conclusion&nbsp;...",
    "authors": ["C.H. Bamford", "R.G. Compton", "C.F.H. Tipper†"],
    "publisher": "Elsevier",
    "publishedDate": "1973-01-01",
    "isbn": "9780080868042",
    "pageCount": 514,
    "price": 41.48,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=OJevSztje7IC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=OJevSztje7IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "WZ0DxnPNAdAC",
    "title": "Name Reactions of Functional Group Transformations",
    "category": "Science",
    "description": "This practical, well-organized reference delves deeply into functional group transformations, to provide all the detailed information that researchers need. Topics are organized into the following sections: oxidation, reduction, asymmetric synthesis, and functional group manipulations Each section includes a description of the functional group transformation, the historical perspective, mechanisms, variations and improvements on the reaction, synthetic utilities and applications for the reaction, experimental details, and references to the primary literature Contributors are well-known and respected for their work on the specific name reactions.",
    "shortDescription": "68% 80% 86% Yield (Method B): 81% 76% 81% 2.5.4.4 One-pot tandem Staudinger/aza- Wittig <b>reactions</b> with carbonyls Under ... the iminophosphorane intermediate that is formed as a result of the Staudinger reaction can <b>react</b> with aldehydes&nbsp;...",
    "authors": ["Jie Jack Li", "E. J. Corey"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2007-07-09",
    "isbn": "9780470176504",
    "pageCount": 768,
    "price": 163.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=WZ0DxnPNAdAC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=WZ0DxnPNAdAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "_qTGDwAAQBAJ",
    "title": "Recent Advances in Applications of Name Reactions in Multicomponent Reactions",
    "category": "Science",
    "description": "Recent Advances in Applications of Name Reactions in Multicomponent Reactions is an ideal reference for researchers and postgraduate students studying organic chemistry, as well as synthetic organic chemists working on the development of novel methodologies for the synthesis of various heterocyclic systems, especially drug design and discovery, in both academia and industry. The book reviews recent applications of name reactions in multicomponents for the synthesis of heterocycles and examines recent advances in applications of significant name reactions, such as Ugi and Passirini, Click, Knoevenagel, Michael, Diels-Alder, Aldol, Mannich, Heck, Huisgen, and Suzuki in MCRs. These reactions can be used in the synthesis of a wide variety of novel heterocycles with different sizes and heteroatoms, as well as in the total synthesis of natural products in order to decrease the number of synthetic steps. Since chiral inductions are necessary for most of these sequential name reactions, their asymmetric catalyzed reactions are also described. Includes the synthesis of many heterocycles, which is ideal for synthetic organic chemists engaged in the synthesis of heterocyclic systems Covers the recent advances of asymmetric synthesis of a wide range of heterocycles in satisfactory enantioselectivities (ees) or distereoselectivities (des) Reviews the synthesis of a wide variety of interesting heterocycles by using a combination of different and versatile name reactions via MCRs",
    "shortDescription": "12 (2015) 147. [114] H. Peng, Y. Hu, R. Xing, D. Fang, Monatsh. Chem. 146 (2015) 2053. [115] B. Dam, A.K. Pal, A. Gupta, Synth. Commun. 46 (2016) 275. [116] A. Mobinikhaledi, N. Foroughifar, A. Khajeh-Amiri, <b>React</b>. Kinet. Mech. Catal.",
    "authors": ["Majid M. Heravi", "Vahideh Zadsirjan"],
    "publisher": "Elsevier",
    "publishedDate": "2020-05-29",
    "isbn": "0128196955",
    "pageCount": 438,
    "price": 122.5,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=_qTGDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=_qTGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "WK-zHDuHET4C",
    "title": "Twisted Photons",
    "category": "Science",
    "description": "This book deals with applications in several areas of science and technology that make use of light which carries orbital angular momentum. In most practical scenarios, the angular momentum can be decomposed into two independent contributions: the spin angular momentum and the orbital angular momentum. The orbital contribution affords a fundamentally new degree of freedom, with fascinating and wide-spread applications. Unlike spin angular momentum, which is associated with the polarization of light, the orbital angular momentum arises as a consequence of the spatial distribution of the intensity and phase of an optical field, even down to the single photon limit. Researchers have begun to appreciate its implications for our understanding of the ways in which light and matter can interact, and its practical potential in different areas of science and technology.",
    "shortDescription": "This book deals with applications in several areas of science and technology that make use of light which carries orbital angular momentum.",
    "authors": ["Juan P. Torres", "Lluis Torner"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2011-03-31",
    "isbn": "3527635378",
    "pageCount": 288,
    "price": 138.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=WK-zHDuHET4C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=WK-zHDuHET4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "vdPbDwAAQBAJ",
    "title": "Security in IoT Social Networks",
    "category": "Science",
    "description": "Security in IoT Social Networks takes a deep dive into security threats and risks, focusing on real-world social and financial effects. Mining and analyzing enormously vast networks is a vital part of exploiting Big Data. This book provides insight into the technological aspects of modeling, searching, and mining for corresponding research issues, as well as designing and analyzing models for resolving such challenges. The book will help start-ups grow, providing research directions concerning security mechanisms and protocols for social information networks. The book covers structural analysis of large social information networks, elucidating models and algorithms and their fundamental properties. Moreover, this book includes smart solutions based on artificial intelligence, machine learning, and deep learning for enhancing the performance of social information network security protocols and models. This book is a detailed reference for academicians, professionals, and young researchers. The wide range of topics provides extensive information and data for future research challenges in present-day social information networks. Provides several characteristics of social, network, and physical security associated with social information networks Presents the security mechanisms and events related to social information networks Covers emerging topics, such as network information structures like on-line social networks, heterogeneous and homogeneous information networks, and modern information networks Includes smart solutions based on artificial intelligence, machine learning, and deep learning for enhancing the performance of social information network security protocols and models",
    "shortDescription": "Feature Frontend Backend Login Facebook API, google API, <b>ReactJS</b> User profiles Connections Location picker cropit, <b>ReactJS</b> React infinitely scroller, <b>ReactJS</b> WebSockets, <b>ReactJS</b> Django -all -auth, Django -rest -auth, Auth0, Django -rest&nbsp;...",
    "authors": ["Fadi Al-Turjman", "B.D. Deebak"],
    "publisher": "Academic Press",
    "publishedDate": "2020-11-03",
    "isbn": "0128216034",
    "pageCount": 266,
    "price": 79.1,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=vdPbDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=vdPbDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
