[
  {
    "bookId": "QHDJDwAAQBAJ",
    "title": "Artificial Intelligence as a Disruptive Technology",
    "category": "Social Science",
    "description": "Artificial intelligence (AI) is the latest technological evolution which is transforming the global economy and is a major part of the “Fourth Industrial Revolution.” This book covers the meaning, types, subfields and applications of AI, including U.S. governmental policies and regulations, ethical and privacy issues, particularly as they pertain and affect facial recognition programs and the Internet-of Things (IoT). There is a lengthy analysis of bias, AI’s effect on the current and future job market, and how AI precipitated fake news. In addition, the text covers basics of intellectual property rights and how AI will transform their protection. The author then moves on to explore international initiatives from the European Union, China’s New Generation Development Plan, other regional areas, and international conventions. The book concludes with a discussion of super intelligence and the question and applicability of consciousness in machines. The interdisciplinary scope of the text will appeal to any scholars, students and general readers interested in the effects of AI on our society, particularly in the fields of STS, economics, law and politics.",
    "shortDescription": "Artificial intelligence (AI) is the latest technological evolution which is transforming the global economy and is a major part of the “Fourth Industrial Revolution.” This book covers the meaning, types, subfields and applications of AI ...",
    "authors": ["Rosario Girasa"],
    "publisher": "Springer Nature",
    "publishedDate": "2020-01-11",
    "isbn": "3030359751",
    "pageCount": 331,
    "price": 74.19,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=QHDJDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=QHDJDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "MUI_DwAAQBAJ",
    "title": "Data Science and Social Research",
    "category": "Social Science",
    "description": "This edited volume lays the groundwork for Social Data Science, addressing epistemological issues, methods, technologies, software and applications of data science in the social sciences. It presents data science techniques for the collection, analysis and use of both online and offline new (big) data in social research and related applications. Among others, the individual contributions cover topics like social media, learning analytics, clustering, statistical literacy, recurrence analysis and network analysis. Data science is a multidisciplinary approach based mainly on the methods of statistics and computer science, and its aim is to develop appropriate methodologies for forecasting and decision-making in response to an increasingly complex reality often characterized by large amounts of data (big data) of various types (numeric, ordinal and nominal variables, symbolic data, texts, images, data streams, multi-way data, social networks etc.) and from diverse sources. This book presents selected papers from the international conference on Data Science & Social Research, held in Naples, Italy in February 2016, and will appeal to researchers in the social sciences working in academia as well as in statistical institutes and offices.",
    "shortDescription": "This book presents selected papers from the international conference on Data Science &amp; Social Research, held in Naples, Italy in February 2016, and will appeal to researchers in the social sciences working in academia as well as in ...",
    "authors": ["N. Carlo Lauro", "Enrica Amaturo", "Maria Gabriella Grassia", "Biagio Aragona", "Marina Marino"],
    "publisher": "Springer",
    "publishedDate": "2017-11-17",
    "isbn": "3319554778",
    "pageCount": 300,
    "price": 96.45,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=MUI_DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=MUI_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "ilWKDwAAQBAJ",
    "title": "Effective Data Visualization",
    "category": "Social Science",
    "description": "NOW IN FULL COLOR! Written by sought-after speaker, designer, and researcher Stephanie D. H. Evergreen, Effective Data Visualization shows readers how to create Excel charts and graphs that best communicate their data findings. This comprehensive how-to guide functions as a set of blueprints—supported by both research and the author’s extensive experience with clients in industries all over the world—for conveying data in an impactful way. Delivered in Evergreen’s humorous and approachable style, the book covers the spectrum of graph types available beyond the default options, how to determine which one most appropriately fits specific data stories, and easy steps for building the chosen graph in Excel. Now in full color with new examples throughout, the Second Edition includes a revamped chapter on qualitative data, nine new quantitative graph types, new shortcuts in Excel, and an entirely new chapter on Sharing Your Data With the World, which provides advice on using dashboards. New from Stephanie Evergreen! The Data Visualization Sketchbook provides advice on getting started with sketching and offers tips, guidance, and completed sample sketches for a number of reporting formats. Bundle Effective Data Visualization, 2e, and The Data Visualization Sketchbook, using ISBN 978-1-5443-7178-8!",
    "shortDescription": "Delivered in Evergreen’s humorous and approachable style, the book covers the spectrum of graph types available beyond the default options, how to determine which one most appropriately fits specific data stories, and easy steps for ...",
    "authors": ["Stephanie D. H. Evergreen"],
    "publisher": "SAGE Publications",
    "publishedDate": "2019-04-03",
    "isbn": "1544350872",
    "pageCount": 352,
    "price": 44.03,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=ilWKDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ilWKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "C3tZDwAAQBAJ",
    "title": "Data Visualization & Presentation With Microsoft Office",
    "category": "Social Science",
    "description": "Written for students, professionals, and social scientists with little or no knowledge of data visualization principles, Data Visualization & Presentation With Microsoft Office by Valerie M. Sue and Matthew T. Griffin presents step-by-step instructions for clearly and effectively presenting data using MS Office programs. Throughout the book, the focus is on turning raw, quantitative data into attractive, well-designed charts and tables that tell an accurate narrative about underlying information. Helpful illustrations, expert tips for solving common issues, and discussions about working efficiently are included to equip readers with the tools they need to engage their audience using a visual format.",
    "shortDescription": "Written for students, professionals, and social scientists with little or no knowledge of data visualization principles, this complete guide presents step-by-step instructions for clearly and effectively presenting data using MS Office ...",
    "authors": ["Valerie M. Sue", "Matthew T. Griffin"],
    "publisher": "SAGE Publications",
    "publishedDate": "2015-10-09",
    "isbn": "1483365166",
    "pageCount": 360,
    "price": 44.03,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=C3tZDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=C3tZDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "3CI_EAAAQBAJ",
    "title": "Statistics and Data Visualization Using R",
    "category": "Social Science",
    "description": "Designed to introduce students to quantitative methods in a way that can be applied to all kinds of data in all kinds of situations, Statistics and Data Visualization Using R: The Art and Practice of Data Analysis by David S. Brown teaches students statistics through charts, graphs, and displays of data that help students develop intuition around statistics as well as data visualization skills. By focusing on the visual nature of statistics instead of mathematical proofs and derivations, students can see the relationships between variables that are the foundation of quantitative analysis. Using the latest tools in R and R RStudio® for calculations and data visualization, students learn valuable skills they can take with them into a variety of future careers in the public sector, the private sector, or academia. Starting at the most basic introduction to data and going through most crucial statistical methods, this introductory textbook quickly gets students new to statistics up to speed running analyses and interpreting data from social science research.",
    "shortDescription": "Designed to introduce students to quantitative methods in a way that can be applied to all kinds of data in all kinds of situations, Statistics and Data Visualization Using R: The Art and Practice of Data Analysis by David S. Brown teaches ...",
    "authors": ["David S. Brown"],
    "publisher": "SAGE Publications",
    "publishedDate": "2021-08-24",
    "isbn": "1544333846",
    "pageCount": 616,
    "price": 77.25,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=3CI_EAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=3CI_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "ei2sAgAAQBAJ",
    "title": "Geography Since the Second World War (RLE Social & Cultural Geography)",
    "category": "Social Science",
    "description": "The discipline of geography has undergone much change and growth in recent years. With growth has come diversity. Before 1945 there were differences between countries in the emphases on subject matter and research approach, although these were all related closely to three main ‘models’ – French, German and American. Since then, the relative importance of French and German influences has declined substantially, including within their own national territories, and the Anglo-American model has grown to world dominance. With that model, however, there is no dominant point of view but rather a multiplicity of competing approaches. These various approaches have had a different reception in other parts of the world, reflecting the base of pre-1945 geographical scholarship, the goals of geographical work set by soceities and the nature of the international contacts. The result is substantial international diversity in the practice of geography. This authoritative volume provides much needed information to make them aware of current international trends.",
    "shortDescription": "The result is substantial international diversity in the practice of geography. This authoritative volume provides much needed information to make them aware of current international trends.",
    "authors": ["Ron Johnston", "Paul Claval"],
    "publisher": "Routledge",
    "publishedDate": "2014-01-23",
    "isbn": "1317907108",
    "pageCount": 294,
    "price": 30.58,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=ei2sAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ei2sAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "5AwkDwAAQBAJ",
    "title": "By Northern Lights",
    "category": "Social Science",
    "description": "Swedish society has recurrently shown a keen geographical sense, meticulously documenting all matters relating to environments, resources and human activities through space and time from the sixteenth century on. Throughout the twentieth century in particular, Sweden won international acclaim for its groundbreaking geographic work on spatial planning, climate change, time-space modelling and landscape history by the likes of Ahlmann, De Geer, Enequist, Hägerstrand, Kant, Olsson and William-Olsson. More recently, with the rising tide of post modernity and multiple processes of globalization, there has been a good deal of debate about novel lines of enquiry into nature and culture, issues of gender, identity and diversity, justice and environmental concern; all of these have sparked a renewed interest in the history and philosophy of the field. Following on from Anne Buttimer's renowned Geography and the Human Spirit, this book not only offers the first book length contextual account of the development of geographic thought in Sweden, but also provides a narrative thread which traces continuity and change in both cognitive styles and professional practices of geography in general.",
    "shortDescription": "Following on from Anne Buttimer&#39;s renowned Geography and the Human Spirit, this book not only offers the first book length contextual account of the development of geographic thought in Sweden, but also provides a narrative thread which ...",
    "authors": ["Anne Buttimer", "Tom Mels"],
    "publisher": "Routledge",
    "publishedDate": "2017-05-15",
    "isbn": "1351953923",
    "pageCount": 236,
    "price": 35.67,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=5AwkDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=5AwkDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "XeqhDwAAQBAJ",
    "title": "Literary Geography: An Encyclopedia of Real and Imagined Settings",
    "category": "Social Science",
    "description": "This reference investigates the role of landscape in popular works and in doing so explores the time in which they were written. • Discusses books and poems covered on the AP English Literature and Composition exam, the most-assigned pieces of literature on high school reading lists, and well-loved contemporary books • Examines specific pieces of literature in the geographical and historical context in which they were written, making this book especially relevant to core curriculum standards • Provides comprehensive content that is unique in the library market • Includes recommendations of complimentary works • Features organization alphabetical by work, making it easy to navigate • Maintains an accessible style useful for high school and general education college courses",
    "shortDescription": "“Review of Humanistic <b>Geography</b> and Literature: Essays on the Experience of Place, by Douglas Pocock.” The Modern Language Review 79, no. 1 (1984): 142–44. Flaim, Mary L., and John J. Chiodo. “A Novel Approach to <b>Geographic</b> Education:&nbsp;...",
    "authors": ["Lynn M. Houston"],
    "publisher": "ABC-CLIO",
    "publishedDate": "2019-08-02",
    "isbn": "1440842558",
    "pageCount": 381,
    "price": 62.33,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=XeqhDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=XeqhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "EZSuDAAAQBAJ",
    "title": "Popular Music and Retro Culture in the Digital Era",
    "category": "Social Science",
    "description": "This book explores the trend of retro and nostalgia within contemporary popular music culture. Using empirical evidence obtained from a case study of fans’ engagement with older music, the book argues that retro culture is the result of an inseparable mix of cultural and technological changes, namely, the rise of a new generation and cultural mood along with the encouragement of new technologies. Retro culture has become a hot topic in recent years but this is the first time the subject has been explored from an academic perspective and from the fans’ perspective. As such, this book promises to provide concrete answers about why retro culture dominates in contemporary society. For the first time ever, this book provides an empirically grounded theory of popular music, retro culture and its intergenerational audience in the twenty-first century. It will appeal to advanced students of popular music studies, cultural studies, media studies, sociology and music.",
    "shortDescription": "This book explores the trend of retro and nostalgia within contemporary popular music culture.",
    "authors": ["Jean Hogarty"],
    "publisher": "Routledge",
    "publishedDate": "2016-07-15",
    "isbn": "1317196724",
    "pageCount": 139,
    "price": 28.89,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=EZSuDAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=EZSuDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
