[
  {
    "bookId": "ZvYaBwAAQBAJ",
    "title": "Black Baseball, Black Business",
    "category": "Sports & Recreation",
    "description": "Roberta J. Newman and Joel Nathan Rosen have written an authoritative social history of the Negro Leagues. This book examines how the relationship between black baseball and black businesses functioned, particularly in urban areas with significant African American populations—Chicago, Detroit, Indianapolis, Kansas City, Newark, New York, Philadelphia, and more. Inextricably bound together by circumstance, these sports and business alliances faced destruction and upheaval. Once Jackie Robinson and a select handful of black baseball’s elite gained acceptance in Major League Baseball and financial stability in the mainstream economy, shock waves traveled throughout the black business world. Though the economic impact on Negro League baseball is perhaps obvious due to its demise, the impact on other black-owned businesses and on segregated neighborhoods is often undervalued if not outright ignored in current accounts. There have been many books written on great individual players who played in the Negro Leagues and/or integrated the Major Leagues. But Newman and Rosen move beyond hagiography to analyze what happens when a community has its economic footing undermined while simultaneously being called upon to celebrate a larger social progress. In this regard, Black Baseball, Black Business moves beyond the diamond to explore baseball’s desegregation narrative in a critical and wide ranging fashion.",
    "shortDescription": "An American Dilemma Social theorists also had concerns about the issue of white <b>business</b> competition with the ... both facing and posed by race <b>businesses</b>: “The weaknesses of Negro <b>business</b> chauvinism are apparent from consideration of&nbsp;...",
    "authors": ["Roberta J. Newman", "Joel Nathan Rosen"],
    "publisher": "Univ. Press of Mississippi",
    "publishedDate": "2014-03-03",
    "isbn": "1617039551",
    "pageCount": 254,
    "price": 30.55,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=ZvYaBwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=ZvYaBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
