[
  {
    "bookId": "eSbsDwAAQBAJ",
    "title": "Data Science and Intelligent Applications",
    "category": "Technology & Engineering",
    "description": "This book includes selected papers from the International Conference on Data Science and Intelligent Applications (ICDSIA 2020), hosted by Gandhinagar Institute of Technology (GIT), Gujarat, India, on January 24–25, 2020. The proceedings present original and high-quality contributions on theory and practice concerning emerging technologies in the areas of data science and intelligent applications. The conference provides a forum for researchers from academia and industry to present and share their ideas, views and results, while also helping them approach the challenges of technological advancements from different viewpoints. The contributions cover a broad range of topics, including: collective intelligence, intelligent systems, IoT, fuzzy systems, Bayesian networks, ant colony optimization, data privacy and security, data mining, data warehousing, big data analytics, cloud computing, natural language processing, swarm intelligence, speech processing, machine learning and deep learning, and intelligent applications and systems. Helping strengthen the links between academia and industry, the book offers a valuable resource for instructors, students, industry practitioners, engineers, managers, researchers, and scientists alike.",
    "shortDescription": "This book includes selected papers from the International Conference on Data Science and Intelligent Applications (ICDSIA 2020), hosted by Gandhinagar Institute of Technology (GIT), Gujarat, India, on January 24–25, 2020.",
    "authors": ["Ketan Kotecha", "Vincenzo Piuri", "Hetalkumar N. Shah", "Rajan Patel"],
    "publisher": "Springer Nature",
    "publishedDate": "2020-06-17",
    "isbn": "9811544743",
    "pageCount": 576,
    "price": 155.08,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=eSbsDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=eSbsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "JH0xEAAAQBAJ",
    "title": "Intelligent Systems Design and Applications",
    "category": "Technology & Engineering",
    "description": "This book highlights recent research on intelligent systems and nature-inspired computing. It presents 130 selected papers from the 19th International Conference on Intelligent Systems Design and Applications (ISDA 2020), which was held online. The ISDA is a premier conference in the field of computational intelligence, and the latest installment brought together researchers, engineers and practitioners whose work involves intelligent systems and their applications in industry. Including contributions by authors from 40 countries, the book offers a valuable reference guide for all researchers, students and practitioners in the fields of Computer Science and Engineering.",
    "shortDescription": "is used in the area of <b>data science</b>. After the explosion of massive data collected by them via various internet methods such as a laptop, smartphone, tablet, desktop, etc., there was substantial growth in the need for data processing&nbsp;...",
    "authors": [
      "Ajith Abraham",
      "Vincenzo Piuri",
      "Niketa Gandhi",
      "Patrick Siarry",
      "Arturas Kaklauskas",
      "Ana Madureira"
    ],
    "publisher": "Springer Nature",
    "publishedDate": "2021-06-02",
    "isbn": "3030711870",
    "pageCount": 1419,
    "price": 155.08,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=JH0xEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=JH0xEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "H4JyEAAAQBAJ",
    "title": "Keyword Search in Databases",
    "category": "Technology & Engineering",
    "description": "It has become highly desirable to provide users with flexible ways to query/search information over databases as simple as keyword search like Google search. This book surveys the recent developments on keyword search over databases, and focuses on finding structural information among objects in a database using a set of keywords. Such structural information to be returned can be either trees or subgraphs representing how the objects, that contain the required keywords, are interconnected in a relational database or in an XML database. The structural keyword search is completely different from finding documents that contain all the user-given keywords. The former focuses on the interconnected object structures, whereas the latter focuses on the object content. The book is organized as follows. In Chapter 1, we highlight the main research issues on the structural keyword search in different contexts. In Chapter 2, we focus on supporting structural keyword search in a relational database management system using the SQL query language. We concentrate on how to generate a set of SQL queries that can find all the structural information among records in a relational database completely, and how to evaluate the generated set of SQL queries efficiently. In Chapter 3, we discuss graph algorithms for structural keyword search by treating an entire relational database as a large data graph. In Chapter 4, we discuss structural keyword search in a large tree-structured XML database. In Chapter 5, we highlight several interesting research issues regarding keyword search on databases. The book can be used as either an extended survey for people who are interested in the structural keyword search or a reference book for a postgraduate course on the related topics. Table of Contents: Introduction / Schema-Based Keyword Search on Relational Databases / Graph-Based Keyword Search / Keyword Search in XML Databases / Other Topics for Keyword Search on Databases",
    "shortDescription": "Degree constraints define the attributes and relations in D . They include (1) the maximum number of attributes inD , and (2) the minimum weight of projection paths in the <b>database</b> schema graph GS . Cardinality constraints define the&nbsp;...",
    "authors": ["Jeffrey Xu Yu", "Lijun Chang", "Lu Qin"],
    "publisher": "Springer Nature",
    "publishedDate": "2022-06-01",
    "isbn": "3031794265",
    "pageCount": 143,
    "price": 20.03,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=H4JyEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=H4JyEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "B7kZDgAAQBAJ",
    "title": "Smart Grid using Big Data Analytics",
    "category": "Technology & Engineering",
    "description": "This book is aimed at students in communications and signal processing who want to extend their skills in the energy area. It describes power systems and why these backgrounds are so useful to smart grid, wireless communications being very different to traditional wireline communications.",
    "shortDescription": "<b>analysis</b>. Today, many engineering projects are exploring big <b>data</b> to discover facts that were unknown before. Using advanced <b>analytics</b>, industry can study big <b>data</b> to understand the current state of the business and track still‐evolving&nbsp;...",
    "authors": ["Robert C. Qiu", "Paul Antonik"],
    "publisher": "John Wiley & Sons",
    "publishedDate": "2017-02-08",
    "isbn": "1118716795",
    "pageCount": 632,
    "price": 99.99,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=B7kZDgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=B7kZDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "EXioDwAAQBAJ",
    "title": "Data Visualization and Knowledge Engineering",
    "category": "Technology & Engineering",
    "description": "This book presents the fundamentals and advances in the field of data visualization and knowledge engineering, supported by case studies and practical examples. Data visualization and engineering has been instrumental in the development of many data-driven products and processes. As such the book promotes basic research on data visualization and knowledge engineering toward data engineering and knowledge. Visual data exploration focuses on perception of information and manipulation of data to enable even non-expert users to extract knowledge. A number of visualization techniques are used in a variety of systems that provide users with innovative ways to interact with data and reveal patterns. A variety of scalable data visualization techniques are required to deal with constantly increasing volume of data in different formats. Knowledge engineering deals with the simulation of the exchange of ideas and the development of smart information systems in which reasoning and knowledge play an important role. Presenting research in areas like data visualization and knowledge engineering, this book is a valuable resource for students, scholars and researchers in the field. Each chapter is self-contained and offers an in-depth analysis of real-world applications. It discusses topics including (but not limited to) spatial data visualization; biomedical visualization and applications; image/video summarization and visualization; perception and cognition in visualization; visualization taxonomies and models; abstract data visualization; information and graph visualization; knowledge engineering; human–machine cooperation; metamodeling; natural language processing; architectures of database, expert and knowledge-based systems; knowledge acquisition methods; applications, case studies and management issues: data administration issues and knowledge; tools for specifying and developing data and knowledge bases using tools based on communication aspects involved in implementing, designing and using KBSs in cyberspace; Semantic Web.",
    "shortDescription": "This book presents the fundamentals and advances in the field of data visualization and knowledge engineering, supported by case studies and practical examples.",
    "authors": ["Jude Hemanth", "Madhulika Bhatia", "Oana Geman"],
    "publisher": "Springer",
    "publishedDate": "2019-08-09",
    "isbn": "3030257975",
    "pageCount": 319,
    "price": 74.19,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=EXioDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=EXioDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "u8OWDwAAQBAJ",
    "title": "An Introduction to Machine Learning",
    "category": "Technology & Engineering",
    "description": "Just like electricity, Machine Learning will revolutionize our life in many ways – some of which are not even conceivable today. This book provides a thorough conceptual understanding of Machine Learning techniques and algorithms. Many of the mathematical concepts are explained in an intuitive manner. The book starts with an overview of machine learning and the underlying Mathematical and Statistical concepts before moving onto machine learning topics. It gradually builds up the depth, covering many of the present day machine learning algorithms, ending in Deep Learning and Reinforcement Learning algorithms. The book also covers some of the popular Machine Learning applications. The material in this book is agnostic to any specific programming language or hardware so that readers can try these concepts on whichever platforms they are already familiar with. Offers a comprehensive introduction to Machine Learning, while not assuming any prior knowledge of the topic; Provides a complete overview of available techniques and algorithms in conceptual terms, covering various application domains of machine learning; Not tied to any specific software language or hardware implementation.",
    "shortDescription": "Just like electricity, Machine Learning will revolutionize our life in many ways – some of which are not even conceivable today. This book provides a thorough conceptual understanding of Machine Learning techniques and algorithms.",
    "authors": ["Gopinath Rebala", "Ajay Ravi", "Sanjay Churiwala"],
    "publisher": "Springer",
    "publishedDate": "2019-05-07",
    "isbn": "3030157296",
    "pageCount": 263,
    "price": 74.19,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=u8OWDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=u8OWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "Mw3BDwAAQBAJ",
    "title": "Optimization in Machine Learning and Applications",
    "category": "Technology & Engineering",
    "description": "This book discusses one of the major applications of artificial intelligence: the use of machine learning to extract useful information from multimodal data. It discusses the optimization methods that help minimize the error in developing patterns and classifications, which further helps improve prediction and decision-making. The book also presents formulations of real-world machine learning problems, and discusses AI solution methodologies as standalone or hybrid approaches. Lastly, it proposes novel metaheuristic methods to solve complex machine learning problems. Featuring valuable insights, the book helps readers explore new avenues leading toward multidisciplinary research discussions.",
    "shortDescription": "This book discusses one of the major applications of artificial intelligence: the use of machine learning to extract useful information from multimodal data.",
    "authors": ["Anand J. Kulkarni", "Suresh Chandra Satapathy"],
    "publisher": "Springer Nature",
    "publishedDate": "2019-11-29",
    "isbn": "9811509948",
    "pageCount": 197,
    "price": 81.61,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=Mw3BDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=Mw3BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "JYTLBQAAQBAJ",
    "title": "Handbook of Computer Vision Algorithms in Image Algebra",
    "category": "Technology & Engineering",
    "description": "Image algebra is a comprehensive, unifying theory of image transformations, image analysis, and image understanding. In 1996, the bestselling first edition of the Handbook of Computer Vision Algorithms in Image Algebra introduced engineers, scientists, and students to this powerful tool, its basic concepts, and its use in the concise representation of computer vision algorithms. Updated to reflect recent developments and advances, the second edition continues to provide an outstanding introduction to image algebra. It describes more than 80 fundamental computer vision techniques and introduces the portable iaC++ library, which supports image algebra programming in the C++ language. Revisions to the first edition include a new chapter on geometric manipulation and spatial transformation, several additional algorithms, and the addition of exercises to each chapter. The authors-both instrumental in the groundbreaking development of image algebra-introduce each technique with a brief discussion of its purpose and methodology, then provide its precise mathematical formulation. In addition to furnishing the simple yet powerful utility of image algebra, the Handbook of Computer Vision Algorithms in Image Algebra supplies the core of knowledge all computer vision practitioners need. It offers a more practical, less esoteric presentation than those found in research publications that will soon earn it a prime location on your reference shelf.",
    "shortDescription": "predictable influence of an image <b>algebra</b> standard on future image processing technology. In this, it can be compared to the influence on scientific reasoning and the advancement of science due to the replacement of the myriad of&nbsp;...",
    "authors": ["Joseph N. Wilson", "Gerhard X. Ritter"],
    "publisher": "CRC Press",
    "publishedDate": "2000-09-21",
    "isbn": "1420042386",
    "pageCount": 448,
    "price": 158.64,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=JYTLBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=JYTLBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "nWLCAgAAQBAJ",
    "title": "Capsule Calculus",
    "category": "Technology & Engineering",
    "description": "This text explores calculus from the engineering viewpoint: differential, integral, and time calculus; equations of motion and their solution; complex variables, algebra, and functions; complex and operational calculus; more. 1962 edition.",
    "shortDescription": "This text explores calculus from the engineering viewpoint: differential, integral, and time calculus; equations of motion and their solution; complex variables, algebra, and functions; complex and operational calculus; more. 1962 edition.",
    "authors": ["Ira Ritow"],
    "publisher": "Courier Corporation",
    "publishedDate": "2013-02-21",
    "isbn": "0486174514",
    "pageCount": 192,
    "price": 7.03,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=nWLCAgAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=nWLCAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "cZSQAQAAQBAJ",
    "title": "Using Science to Improve the BLM Wild Horse and Burro Program",
    "category": "Technology & Engineering",
    "description": "Using Science to Improve the BLM Wild Horse and Burro Program: A Way Forward reviews the science that underpins the Bureau of Land Management's oversight of free-ranging horses and burros on federal public lands in the western United States, concluding that constructive changes could be implemented. The Wild Horse and Burro Program has not used scientifically rigorous methods to estimate the population sizes of horses and burros, to model the effects of management actions on the animals, or to assess the availability and use of forage on rangelands. Evidence suggests that horse populations are growing by 15 to 20 percent each year, a level that is unsustainable for maintaining healthy horse populations as well as healthy ecosystems. Promising fertility-control methods are available to help limit this population growth, however. In addition, science-based methods exist for improving population estimates, predicting the effects of management practices in order to maintain genetically diverse, healthy populations, and estimating the productivity of rangelands. Greater transparency in how science-based methods are used to inform management decisions may help increase public confidence in the Wild Horse and Burro Program.",
    "shortDescription": "The National Academy of <b>Sciences</b> is a private, nonprofit, self-perpetuating society of distinguished scholars engaged in scientific and engineering research, dedicated to the furtherance of <b>science</b> and technology and to their use for&nbsp;...",
    "authors": [
      "Committee to Review the Bureau of Land Management Wild Horse and Burro Management Program",
      "Board on Agriculture and Natural Resources",
      "Division on Earth and Life Studies",
      "National Research Council"
    ],
    "publisher": "National Academies Press",
    "publishedDate": "2013-09-18",
    "isbn": "0309264952",
    "pageCount": 373,
    "price": 44.52,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=cZSQAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=cZSQAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "jzkvBQAAQBAJ",
    "title": "Chemistry and Metallurgy",
    "category": "Technology & Engineering",
    "description": "Modern Power Station Practice, Volume 5: Chemistry and Metallurgy focuses on power station chemistry and metallurgy. The book first offers information on power station chemistry, including the use, preparation, sampling, storage, and transport of coal to power stations. Other considerations include the commercial use of ash, analysis and testing of coal and coke, gas-side cleaning of boilers, oil firing, burner fuels, testing of fuel oils and gases, and air pollution. The text also reviews water treatment relative to the operation of boilers. The corrosion of metals; sampling and analysis of feed water, boiler water, and steam; instrumentation for quality control; and on-load corrosion of boilers are discussed. The book also looks at cooling water systems in water treatment plants. Topics include water softening, evaporators, sources and quality of raw water, demineralization, and boiler feed water composition. The text also gives emphasis to plant cleaning and inspection and metallurgy and welding. The book is a valuable reference for readers interested in power station chemistry and metallurgy.",
    "shortDescription": "INTRODUCTION TO POWER STATION <b>CHEMISTRY</b> 1.1.1. Historical During the pioneer years 1880 to 1920, technical development in the generation and supply of electricity was comparatively slow and <b>chemical</b> services to power stations were&nbsp;...",
    "authors": ["A. Sherry", "J. S. Beck", "A.E. Cruddace"],
    "publisher": "Elsevier",
    "publishedDate": "2013-10-22",
    "isbn": "1483153215",
    "pageCount": 528,
    "price": 49.66,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=jzkvBQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=jzkvBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  },
  {
    "bookId": "dbxoX1RzgiwC",
    "title": "Non-Equilibrium Reacting Gas Flows",
    "category": "Technology & Engineering",
    "description": "In the present monograph, we develop the kinetic theory of transport phenomena and relaxation processes in the flows of reacting gas mixtures and discuss its applications to strongly non-equilibrium conditions. The main attention is focused on the influence of non-equilibrium kinetics on gas dynamics and transport properties. Closed systems of fluid dynamic equations are derived from the kinetic equations in different approaches. We consider the most accurate approach taking into account the state-to-state kinetics in a flow, as well as simplified multi-temperature and one-temperature models based on quasi-stationary distributions. Within these approaches, we propose the algorithms for the calculation of the transport coefficients and rate coefficients of chemical reactions and energy exchanges in non-equilibrium flows; the developed techniques are based on the fundamental kinetic theory principles. The theory is applied to the modeling of non-equilibrium flows behind strong shock waves, in the boundary layer, and in nozzles. The comparison of the results obtained within the frame of different approaches is presented, the advantages of the new state-to-state kinetic model are discussed, and the limits of validity for simplified models are established. The book can be interesting for scientists and graduate students working on physical gas dynamics, aerothermodynamics, heat and mass transfer, non-equilibrium physical-chemical kinetics, and kinetic theory of gases.",
    "shortDescription": "The production terms in equations (3.39), are given by the formulae <b>react</b>(0) <b>react</b>(0) Roots =X, so due, l J R&quot; - X. s is&#39;&quot;&#39;du c - - cl J C l J and contain the zero-order operators of VV2 and TRV vibrational energy exchanges and chemical&nbsp;...",
    "authors": ["Ekaterina Nagnibeda", "Elena Kustova"],
    "publisher": "Springer Science & Business Media",
    "publishedDate": "2009-07-09",
    "isbn": "3642013902",
    "pageCount": 252,
    "price": 118.71,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=dbxoX1RzgiwC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=dbxoX1RzgiwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
