[
  {
    "bookId": "8RQiAQAAQBAJ",
    "title": "Tourism Art and Souvenirs",
    "category": "Travel",
    "description": "This book examines the relationship between art and tourism through the study of the material culture of tourism: tourist art and souvenirs. It thoroughly examines how to categorise the material culture of tourism within the discourses of contemporary art and cultural anthropology, and demonstrates that tourist art is a unique expression of place and genuine artistic style. The first investigation to consider the activity of souvenirs from both indigenous and settler tourist sites, it brings a unique addition to the existing, dated, research in the area. Working initially from Graburn’s definition of tourist art, as the art of one culture made specifically for the consumption of another, Tourism Art and Souvenirs sheds light on important aspects of the souvenir that have not been widely discussed. The most recent research is used to consider how the souvenir is designed and consumed, consumer expectations and influence on the character of the souvenir, how the souvenir maker is consumed by the tradition of heritage and how products become successful as souvenirs. The title also investigates the language involved in the representation of place and the recording of experience through the souvenir, developing a method that expresses the descriptive data of individual souvenir artefacts graphically so the patterns of language may be analysed. Enhancing the understanding of material culture in tourism and therefore adding to future tourism development this volume will be of interest to upper level students, researchers and academics in tourism, culture, heritage and sustainability.",
    "shortDescription": "<b>art</b>« asa genuine and uniqueartistic expression and style, occurred in North America with the publication ofGraburn«s ground-breaking Ethnic and Tourist <b>Arts</b>: Cultural Expressions from the Fourth World (1976). In this text, upon which it&nbsp;...",
    "authors": ["David Hume"],
    "publisher": "Routledge",
    "publishedDate": "2013-10-01",
    "isbn": "1135038228",
    "pageCount": 192,
    "price": 31.43,
    "imageLinks": {
      "smallThumbnail": "http://books.google.com/books/content?id=8RQiAQAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
      "thumbnail": "http://books.google.com/books/content?id=8RQiAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
    }
  }
]
